[
{"objectID": "ad62e2145253a0a823e6e3f36da731f3", "title": "College of Dentistry | Howard University", "body": "Program Description:\n\n\nThe Advanced Education in General Dentistry (AEGD) residency program at the Howard University College of Dentistry (HUCD) is a one-year certificate-granting course of study and development which offers the newly or recently graduated dentist an opportunity to expand the capability to provide high-quality comprehensive clinical care to a diverse population.  The foundations of ethics, professionalism, compassion, and evidence-based practice are woven throughout our didactic and clinical activities.  Our program is accredited (most recent – 2017) by the American Dental Association (ADA) Commission on Dental Accreditation (CODA).\nThe backbone of this program is exposing learners to a variety of meaningful clinical experiences, guided by engaged clinical faculty supervision and supported by daily coaching, assessment, and feedback.  The program director is a graduate of a two-year AEGD residency program and is a diplomate of the American Board of General Dentistry, and our residents benefit from consistent endodontic, periodontic, and prosthodontic specialty faculty support during our in-house clinical sessions.  We employ modern modalities such as the axiUm electronic health record and MiPACS digital radiography, and complement conventional clinical techniques with rotary endodontics, intraoral laser, digital intraoral impressions, cone beam computerized tomography (CBCT), and computer-assisted design/manufacturing (CAD-CAM) technology.  \nMost clinical services are provided within our AEGD clinical space; additional rotation sites include the Howard University Hospital (oral &amp; maxillofacial surgery, anesthesia) and a local community-based general dentistry clinic for low-income clientele.  We aim to enhance knowledge and clinical competency across the spectrum of comprehensive dentistry, with the central philosophy of patient-centered, problem-based, phased treatment planning; the ability to thoroughly assess patients and then generate and execute predictable individualized plans is an expectation for successful matriculation.    \nThe didactic curriculum includes biologic, diagnostic, and clinical sciences in both classroom and seminar formats, and case-based learning and application of principles to the clinical arena emphasized via various patient care conferences, literature reviews, resident-run topic vignettes, “grand case” treatment plan presentations, and collaboration with resident peers in the HUCD Pediatric Dentistry, Orthodontic, and General Practice Residency programs.   \nProgram Goals:\n\n\nConsistent with the ADA CODA Accreditation Standards for Advanced Education Programs in General Dentistry, our program goals are to enable our graduates to:\nPatient Safety &amp; Infection Control: See here\nProgram Director:\nApplication Requirements:\n\n\n\nAdmission Criteria:\n\n\nFor further information regarding the HUCD AEGD program, please contact Dr. Robert Gamble (robert.gamble@howard.edu) or Ms. Lauren Warner (lauren.warner@howard.edu).", "Program Name": "Howard University", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "http://huhealthcare.com/education/colleges/dentistry/programs/postdoctoral-programs/advanced-education-in-general-dentistry", "keywords": ["successful matriculation", "further information", "grand case", "digital radiography", "clinical experiences", "additional rotation", "advanced education", "daily coaching", "local community", "central philosophy"]},
{"objectID": "49d51e878b4641d37d719357ea483c6d", "title": "Advanced Education in General Dentistry Program - AEGD", "body": "Subscribe to receive information about NYU Langone Dental Medicine Postdoctoral Residency Programs.\nNow\nThe COVID-19 vaccination is a requirement for employment at NYU Langone, unless you have been approved for an exemption by NYU Langone. \n\nAs of February 7th we have opened our FREE Post-Match Application\nA unique and exceptional program in concept and design, the AEGD (PGY-1 level = 12 months; PGY-2 level - second year optional) Program is part of NYU Langone Dental Medicine Postdoctoral Residency Programs. The AEGD Program advances a resident's skills in general dentistry and is fully accredited by the Commission on Dental Accreditation (CODA) of the American Dental Association (ADA). All affiliated clinical training sites are CODA approved to administer NYU Langone Dental Medicine's Postdoctoral Residency Programs. Residents can train in one of hundreds of the program’s affiliated CODA-approved training sites throughout the continental United States, Alaska, Hawaii and the Caribbean. Residents are guided and mentored on-site by acclaimed faculty members while performing procedures on large and ethnically-diverse vulnerable populations. Upon successful completion of the program, residents graduate as highly skilled and confident dental practitioners, fully equipped to meet the challenges of the complex world of modern dentistry.\nTo see a list of locations where AEGD positions are offered, click here.\nDecember 1 \n$48,082(U.S./Can)\n*Benefits include medical, dental, liability insurance, prescription plan, PTO days, holidays, continuing education days\nEstablished in 1988, the AEGD Program turns accomplished dental-school graduates into advanced clinicians while residents concurrently provide oral healthcare to vulnerable communities. The program is the largest in the world of its kind and builds confidence and expertise in diagnosing, treating and managing the oral healthcare needs of dental patients in community health centers, private solo or group practices, dental public health programs, schools of dentistry, healthcare organizations and clinical operations. Since inception, the program has successfully prepared thousands of dental practitioners while fulfilling its mission to serve large, ethnically diverse and needy communities by providing comprehensive, high-quality dental care. Residents contribute to a national public health initiative to improve upon access to and receipt of quality oral health care services by these communities.\nDuring their academic year, residents will receive clinical experience in most disciplines of dentistry including preventive, restorative, endodontics, periodontics, removable prosthodontics, fixed prosthodontics, hard and soft tissue surgery, sedation techniques, pain and trauma management, and dental public health. The patients treated by residents represent children, adults and the elderly, as well as populations that present with intellectual and/or developmental disabilities and a variety of medically complex conditions.  Patient visits generated by residents may range from 1,500 to 2,000 annually.  The clinical experience is complemented with a robust didactic curriculum.\nThe program guides the residents to build upon confidence and competence with diagnosing, treating and managing the oral health needs of dental patients in a variety of practice settings including community health centers, private or group practices, Indian Health Service sites, and dental school campuses. Residents will practice in an environment that promotes interdisciplinary, inter-professional patient care management as they work collaboratively with allied dental health care providers, physicians, and other health care practitioners. \nTo view the goals and objectives of the AEGD program, click here.\nClinical curriculum:\n\nResident Schedule:\nClinical training sites provide the residents with the resources necessary to achieve clinical training experiences and utilizing current methods, materials and equipment in a modern practice environment. Didactic Curriculum:\nSecond-year residents participate in coursework related to research, public health and evidence-based methodologies. These residents will ultimately develop a public health project that is publishable and presentable in journals and dental and/or public health related venues.\nThe AEGD Program has received national recognition for developing a unique and innovative concept in the training of dental residents. Residents are placed in primary care facilities, for example, community health centers in comparison to the traditional hospital or dental school-based setting. All clinical training sites affiliated with the program for resident training are CODA approved clinical training sites.  The program’s objective is to have residents practice comprehensive general dentistry in multi-specialty, interdisciplinary group practice. The overall goal is to prepare the residents to become super-generalists while facilitating the transition from education to career, as well as have them participate in a public health initiative towards improving access to oral health care services for underserved populations.\nApplicants can visit the American Dental Association’s (ADA) website for the program’s accreditation status:\n*The ADA website will only list the sponsoring institution’s (NYU Langone Dental Medicine) accreditation status and not the status of the program’s individual clinical training sites.  All clinical training sites are “approved clinical training sites” of the program and meet with CODA standards.\nThe AEGD program network is structured into four zones: northeast, southeast, west-central and west. Each zone is comprised of regions. The regions are comprised of groups of clinical training sites. To ensure that residents receive superior advanced educational and clinical experience, all NYU Langone Dental Medicine affiliated clinical training sites are critically evaluated by our Vice President of Dental Education, Vice President of the AEGD program and the AEGD Administrative team. Program administration conducts ongoing assessment of the clinical training sites to assess the facility, equipment, materials, resources, and faculty and support staff credentials to verify that the training sites meet the program’s requirements and CODA standards. All sites meet the program’s requirements and CODA standards and are typically modern state-of-the-art facilities.  General dentists comprise the majority of the clinical teaching staff and many sites have a variety of specialists on staff.  Faculty to resident ratio exceeds 1:1. There are a minimum of 2 and up to 15 AEGD residents training per site.\nClinical training sites are calibrated to the program’s requirements and CODA standards.  However, each clinical training site is unique regarding the additional resources they provide to the program to supplement and enhance upon the core clinical curriculum and experiences ultimately provided to the residents that includes: patient demographics, faculty and staff, specialized services, rotations and/or supplemental experiences and public health initiatives. \nPGY-1 Level:\nProgram Requirements:\nGraduation from an accredited U.S. or Canadian Dental School. DDS/DMD required\nNY State Applicants Only-Graduates with an international dental degree AND a U.S. or Canadian DDS/DMD degree:For applicants who have earned BOTH a dental degree from a non-US or Canadian school, AND a US or Canadian DDS/DMD program, your education must be approved by the NY State Department of Education for your application to be considered. To receive approval, candidates must complete and submit an Education Record Form (ERF) to the program and to the NY State Department of Education. The document can be accessed through the website: www.op.nysed.gov \nImmigration Sponsorship:\nProgram participants must provide documentation of identity and U.S. work authorization valid for the duration of the program, as per Form I-9 requirements; failure to provide documentation of U.S. work authorization for the duration of the program will result in termination from the program and the participant will not be issued a completion certificate. Persons with an Employment Authorization Document (EAD card), including F-1 students in a period of Optional Practical Training (OPT), are advised to ensure they can independently secure U.S. work authorization valid for the duration of their program. H-1B sponsorship is not provided for this program. Due to the provision in NAFTA for TN status for the occupation of Dentist, TN sponsorship is provided for eligible program participants.\nPASS:All applicants are required to submit their applications to the program through PASS. Candidates should check the PASS website at www.adea.org/PASSapp for more information about application requirements and deadlines.\nFor most regions, program deadline is December 1.All program regions have their own PASS ID number.  Candidates can apply to as many regions as they desire.\nRequired Application Documents:\nNBDE: The program accepts NBDE exam results, however the examination is not required for application to the program.INBDE: The program accepts INBDE exam results, however the examination is not required for application to the program.\nRecommendation Letters/Personal Evaluation Forms (PEFS): The program requires a minimum of 3 recommendation letters/PEFS from CLINICAL FACULTY; faculty who have observed, evaluated, and worked directly with you during patient care.\nDean's Letter of Recommendation\nDental School Diploma: Notarized copy must be included in the application only from those applicants who have already graduated from dental school at the time of application to the program.\nCV: Must include the following information\nDental school transcript\nPersonal statement\n\nState Dental License Eligibility:If a region requires a state dental license or permit to practice dentistry within the scope of the program, applicants must be license eligible.  Please refer to the table below regarding individual state dental board requirements for licensure.\nMATCH:All applicants are required to register for a MATCH ID number. All program regions have their own MATCH ID number.For more information about the MATCH process, rank order submission deadline and release of MATCH results, please visit the website: www.natmatch.com/dentres.\nPOST- MATCH:The program will accept applications after the MATCH results are released and if positions are available. You can apply using the PASS application until it closes in early February. You can also apply using our free post-match application.\n\nPGY-2 Level:Application requirements for the optional PGY-2 level are the same as for the PGY-1 level including: evidence of completion of a PGY-1 level CODA accredited AEGD or GPR program.\n  Dental Resident Permit at Nonprofits or Dental License\nTemporary License or Dental License\nLimited Dental license or Dental License\nEducational Limited License or Dental License\nDental Resident License or Dental License\nLimited License (not at a private practice) or DentalLicense\nResident Permit or Dental License\nTemporary License or Dental License\nLimited License or Dental License\nLimited License or Dental License\nDental Intern, Dental Resident Permit or Dental License\n© 2021 NYU Langone Health. All Rights Reserved. The contents of this communication are for informational purposes only and do not constitute an endorsement or promotion of the external entity or any of its products or services.\nSitemap       Terms &amp; Conditions       Privacy Guidelines", "Program Name": "NYU Langone Dental Medicine - Miami, FL", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.nyulangonedental.org/programs/aegd", "keywords": ["supplemental experiences", "informational purposes", "resident training", "many regions", "private solo", "complex conditions", "postdoctoral residency", "dental intern", "dental patients", "practical training"]},
{"objectID": "cc6532bef6fe0e3f2275d6c3abf22801", "title": "Advanced Education in General Dentistry | SIU School of Dental Medicine", "body": "Thank you for your interest in the Advanced Education in General Dentistry Program of SIU School of Dental Medicine.\nThe Advanced Education in General Dentistry (AEGD) program is a fully accredited one-year program that offers an optional second year. The program is designed to refine and enhance the resident’s clinical skills and scientific knowledge while bridging the gap between dental school and general dental practice. The program provides the resident with broad clinical experience in all phases of general dentistry in addition to implant dentistry and IV sedation technique. The faculty and staff at SIU are dedicated to helping every resident reach his/her maximum potential.\nAs you browse our website, we hope you examine how the AEGD program at SIU has positioned itself to meet the exciting challenges of the future. We believe you will begin to appreciate why this program is one of the premiere AEGD Programs in the country.\nGary M. Fischer, DMD Program Director\nKatie Hanser, DMD Assistant Program Director", "Program Name": "Southern Illinois University School of Dental Medicine", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.siue.edu/dental/post-graduate-programs/aegd/", "keywords": ["aegd program", "dental practice", "general dentistry", "scientific knowledge", "dental medicine", "second year", "dmd program", "clinical experience", "implant dentistry", "maximum potential"]},
{"objectID": "70753d78994f7121259b8a9e67940533", "title": "Advanced Education in General Dentistry »  Office of Admissions » College of Dentistry » University of Florida", "body": "This 12-month Advanced Education Program is designed to provide advanced clinical and didactic training in disciplines of general dentistry beyond the training received in dental school.\nThe program is located in a facility at St. Petersburg College in Seminole, Florida that houses 17 operatories and is designed to model the private practice setting. This facility is a satellite clinic for the College of Dentistry. All the clinical disciplines in dentistry are covered. Patient treatment is frequently complex and challenging, with multiple opportunities for experience in dental implants, periodontal surgery, advanced prosthetics, oral surgery, orthodontics, and sedation.\nThe faculty, which includes specialists from all the dental disciplines and general dentists, provide continuous coverage in the clinic. Seminars, literature reviews, case presentations, and treatment planning seminars are part of the educational program. Practice management is an integral part of the program.\nThis program will provide a Certificate of Completion in Advanced Dental Education in General Dentistry.\nA stipend is available. No tuition is required.\nFor additional program information, please visit the links below:\nTo be eligible for admission, applicants must graduate from an American Dental Association (ADA) or Commission on Dental Accreditation of Canada (CDAC) accredited Dental School.\nThe AEGD Seminole Program is NOT designed to prepare Internationally-Educated Dentists to practice dentistry in the U.S.\nIf you are an Internationally-Educated Dentist interested in becoming licensed to practice dentistry in the U.S., please check out our Internationally-Educated Dentist Programs.\nAll international students must secure an F1 visa prior to matriculation on July 1.\nDr. Pamela Sandow\nUniversity of Florida College of Dentistry/AEGD Seminole\nP.O. Box 100402\n1395 Center Drive, D3-5\nGainesville, FL 32610-0402\nPhone: 352-273-5956 | Fax: 352-846-0311\nEmail: GradAdmissions@dental.ufl.edu\nThe deadline to apply to this program is Saturday, October 1, 2022.\nWe strongly encourage all applicants to have complete applications on file with PASS and UFCD prior to the deadline.\nAll program applicants must apply through PASS (Postdoctoral Application Support Service), sponsored by the American Dental Education Association (www.adea.org). ADEA PASS is the centralized application service for applicants for advanced dental education programs.\n  1. Apply to ADEA PASS (All Applicants)\n  2. Upload Documents to PASS Application (All Applicants)\n  1. Interview (Upon Invitation Only)\n  2. Provide Official Documents (Upon Request for Accepted Candidates)\nApplying through ADEA PASS (opens in May) is mandatory for this program. We advise applicants to apply as early as possible. Only one application per cycle is permitted.\nADEA PASS\nEmail: passinfo@passweb.org\nPhone: (617) 612-2065\nAll application documents that are listed below should be uploaded with the PASS application.\nFor matriculation, the following documents must be on file with the University of Florida College of Dentistry:", "Program Name": "University of Florida, University Partnership Center, Seminole", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://admissions.dental.ufl.edu/advanced-graduate-programs/advanced-education-in-general-dentistry/", "keywords": ["advanced prosthetics", "multiple opportunities", "dental implants", "international students", "private practice", "dental disciplines", "advanced education", "continuous coverage", "general dentistry", "periodontal surgery"]},
{"objectID": "9ec04698afd97c04433a91a7c073d32f", "title": "AEGD - University of Maryland, Baltimore", "body": "Office of Admissions\nddsadmissions@umaryland.edu\n650 W. Baltimore St.Suite 6410 (Dean's Suite, 6th Floor South)Baltimore, MD 21201\nP  410-706-7472\nF  410-706-0945\n‌\nAdvanced Education in General Dentistry at the University of Maryland is comprised of two programs--the one-year course and the two-year AEGD certificate/MS/PhD degree option.\nThe one-year Advanced General Dentistry Program is designed to improve and refine residents' scientific knowledge and clinical skills in the practice of general dentistry. It prepares the resident to assess the patient's general health status relative to anticipated dental treatment and to plan and deliver that treatment.\nThe two-year AEGD program incorporates all the goals and objectives of the one-year program and is designed to expand the residents' educational opportunities.\nAPPLICATION REQUIREMENTS: (We do not waive any application requirements)\nGeneral Information on Dental Licensure\n2011 - 2012 Orientation Manual\nPostdoctoral Application Support Service (PASS)\nPostdoctoral Dental Matching Program (MATCH)\nWorld Education Services (WES)\nEducation Credential Evaluators, Inc. (ECE)\nTest of English as a Foreign Language (TOEFL)\nInternational English Testing System (IELTS)", "Program Name": "University of Maryland", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.dental.umaryland.edu/admissions/programs/postgraduate-dental/aegd/", "keywords": ["general dentistry", "scientific knowledge", "dental matching", "educational opportunities", "general information", "english testing", "general health", "foreign language", "dental treatment", "clinical skills"]},
{"objectID": "6e0b3e4405d3f7fbf2017e2b3de86191", "title": "General Dentistry | School of Dental Medicine", "body": "The mission of the Division of General Dentistry is to train predoctoral students and postdoctoral residents in all aspects of general dentistry and to contribute to improvements in the oral health of the community through direct patient care, both within UConn Health and throughout the State of Connecticut with collaborative relationships with community partners. The Division achieves its goals through education, patient care activities and research endeavors.\nAt the predoctoral level, faculty in the Division are responsible for curriculum in general dentistry, treatment planning, risk management, ethics, law and jurisprudence, geriatrics, and special care dentistry. Faculty are engaged in the didactic, preclinical, and clinical instruction of predoctoral dental students in these domains, as well as in other activities offered throughout the scope of the D.M.D. curriculum.\nAt the postdoctoral level, the Division offers the Advanced Education in General Dentistry residency program which provides outstanding opportunities for advanced training in all aspects of general dentistry at the PGY1 and PGY2 level. The residency is designed to refine and enhance the resident’s clinical skills and scientific base to improve the practice of general dentistry. The Division also offers the General Dentistry fellowship program for a limited number of individuals who have completed two years of postdoctoral general dentistry training and wish to further their education and training in general dentistry.\nThe Advanced Education in General Dentistry program is a one-year (optional second-year) residency with special emphasis in clinical general dentistry. The residency is designed to refine and enhance the resident’s clinical skills and scientific knowledge base in order to improve the practice of general dentistry. The program enrolls eighteen first-year residents who practice and learn in a setting that closely resembles a modern group practice.\nThe Advanced Education in General Dentistry residency prepares individuals to enter the field of general dentistry with confidence and expertise.\nThe goals of the program are to:\nThe Advanced Education in General Dentistry residency program offers selected individuals who have completed the PGY1 residency program opportunities to further their education and training through additional clinical and didactic experiences.\nThe PGY2 program adds the following goals:\nThe AEGD program includes clinical and didactic experiences designed to prepare residents for a successful and fruitful career. Approximately fifteen percent of the resident’s time is devoted to a comprehensive didactic program, designed to build upon and enhance prior knowledge. Advanced instruction, in the form of lectures, seminars, and conferences, is offered in all disciplines of dentistry and dental practice, including restorative dentistry, fixed and removable prosthodontics, oral and maxillofacial surgery, pediatric dentistry, orthodontics, periodontics, endodontics, preventive dentistry, practice management, epidemiology, TMJ dysfunction, sedation, pain and anxiety control, geriatric dentistry, medicine, management of medically compromised and developmentally disabled patients, physical assessment, and infection control. Residents participate in literature reviews, case presentations, treatment planning seminars, and the management of the group practice.\nThe AEGD program provides a solid, comprehensive clinical experience that is centered around the general dentistry clinic at UConn Health. Our goal is to have the area serve as a model group practice. It is within this setting that the resident learns management skills, maintenance of financial and medico-legal documents and records, operatory organization, clinic management, appointment control, and overall patient and practice management. Residents receive advanced training in oral diagnosis, treatment planning, and case management to improve the residents' ability to provide patients with comprehensive care using a multidisciplinary approach. All phases of care are rendered within the clinic, allowing each resident to manage a wide variety of patients and treatment modalities.\nAEGD residents may rotate through community healthcare centers around the State of Connecticut and UConn Health clinics to enhance the educational and clinical experience.\nThe AEGD program is responsible for the dental emergency service of UConn Health and residents rotate on emergency on-call. Residents learn to manage acute dental problems, interface with all health disciplines in the John Dempsey Hospital, and provide a broad range of urgent dental treatment to a diverse patient population.\nThe AEGD program’s competency and proficiency statements describe the attributes of a graduate of the program. They are intended to communicate the expectations of the faculty to the resident and serve as the basis for evaluation of the resident’s satisfactory completion of the program.\nEach statement is designated as either an area of competency (C) in which graduates are expected to have little experience at the beginning of their programs or as an area of proficiency (P) in which graduates are expected to be competent at the beginning of their program and gain further experience, skill and judgment as the program progresses.\nThe AEGD program occupies a modern, fully equipped thirty-two chair facility within UConn Health and is an integral component of the School of Dental Medicine. A complete staff of dental auxiliaries, clerks, and a practice administrator is dedicated to the program.\nThe faculty of the AEGD program includes a full-time program director, several part-time attendings, and a large complement of volunteer attendings. Specialty support and instruction are provided in every discipline by the faculty of the School of Dental Medicine.\nOpportunities exist for a limited number of general dentistry fellowship positions. The general dentistry fellowship is optional for individuals who have completed the AEGD residency (PGY1 and PGY2) and wish to further their training.\nResidents in the Advanced Education in General Dentistry program are registered as postdoctoral students in the School of Dental Medicine and are appointed as hospital residents at UConn Health. Residents receive an annual salary; tuition and clinic fees are waived.\n \nThe AEGD program is open to graduates of accredited U.S. or foreign dental schools. Candidates must possess a D.D.S. or D.M.D. degree (or equivalent) prior to beginning the program. If the applicant’s native language is other than English, or they have graduated from a school that its official language is other than English, results of the TOEFL examination (minimum score of 90 for the computer-based exam) are required. We do not accept the \"My Best Score\".\nThe AEGD program participates in the Postdoctoral Application Support Service (PASS) offered by the American Association of Dental Schools. Additional application requirements may be found within the PASS application packet. Information and an application can be obtained by contacting:\nPASS\n1625 Massachusetts Avenue, NW\nSuite 600\nWashington, DC 20036-2212\nPhone: 1-800-353-2237\nFax: 202-667-4983\nEmail: pass@adea.org\nThe AEGD program also participates in the National Matching Service and all positions are offered through the match. Applicants are required to register with the match. For more information about the match, contact:\nNational Matching Services\n595 Bay Street\nSuite 301, Box 29\nToronto, Ontario\nCanada M5G 2C2\nPhone: 416-977-3431\nFax: 416-977-5020\nEmail: matchinfo@natmatch.com\n \n*Obtaining a badge from UConn Health is mandatory and required in order to be enrolled. This process includes a full background check. Badges are subject to approval from UConn Police and the Risk Management Office. \n\nOpportunities exist for a limited number of general dentistry fellowship positions. The general dentistry fellowship is optional for individuals who have completed the AEGD residency (PGY1 and PGY2) and wish to further their training.\n \nDivision Chair\n Aadarsh Gopalakrishna, D.D.S., M.S.\nProfessors\nSarita M. Arteaga, D.M.D., MAGD\nAnna Dongari-Bagtzoglou, D.D.S., M.S., Ph.D.\nSteven M. Lepowsky, D.D.S.\nR. Lamont MacNeil, D.D.S., M.D.S.\nDonna Paolella, D.M.D., M.B.A.\n\nAssociate Professors\nReza B. Kazemi, D.M.D. \nAssistant Professors\nRonald Albert, D.M.D.\nEric Bernstein, J.D., Ed.D.\nPooja Bysani, D.D.S.\nElias M. Chatah, D.M.D., Pharm.B., M.S.\n Carlos Degollado, D.D.S.\nTina Liang, D.M.D.\nSusan Lieb, D.D.S.\nYuri Levit, D.D.S.\nNaseema Maiary, D.D.S.\nIsabella Paolino, D.D.S.\nSteve Ruiz, D.D.S.\nSree Raghavendra, D.M.D.\nFrancisco Suarez, D.D.S.\nInstructors\nMaria Alvarado, D.D.S.\nBasma Essawy, D.D.S, M.Dent.Sc.\nRosa Pelaez-Shelton, D.D.S., M.D.S.\nFlor Robles Mijangos, D.D.S.\nVolunteers\nDavid Fried, D.M.D.\nJoseph Gargano, D.M.D.\nRohit Gupta, D.D.S.\nThomas P. Kahl, D.D.S.\nMarianne Lehmann, D.D.S.\nFrederick Mackler, D.M.D., M.A.\nJason Mielcarek, D.M.D.\nAlbert Natelli, D.D.S.\nRobert VanWyck, D.D.S.\nDr. Steve Ruiz\nProgram Director\nAdvanced Education in General Dentistry\nUConn School of Dental Medicine\nMail Code 3811\n263 Farmington Avenue\nFarmington, CT 06030\nPhone: 860-679-4920\n\n \n263 Farmington Avenue\nFarmington, CT 06030\nMap and Directions\nAbout Us\nPrograms and Admissions\nResearch\nStudent Life\nGive\nInformation for:\nProspective Students\nCurrent Students\nFaculty\nAlumni and Friends\nPatients", "Program Name": "University of Connecticut", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dentalmedicine.uconn.edu/divisions/general-dentistry/", "keywords": ["aegd program", "dental practice", "aegd residents", "patient care", "scientific knowledge", "special care", "wide variety", "official language", "predoctoral students", "limited number"]},
{"objectID": "b59bcf2e9ad9c3a53ffa5ff963c923fc", "title": "​Advanced Education in General Dentistry Program (AEGD) | College of Dental Medicine", "body": "Vicky Evangelidis-Sakellson, DDS, MPH\nProgram Director\n \n \nApply to the AEGD Program \nThe Advanced Education in General Dentistry (AEGD) Postdoctoral Program is a 12-month certificate program with an optional second year. The AEGD program is open to US/Canadian and foreign-trained dentists. This intensive clinical and academically rigorous full time program is designed to prepare accepted applicants to deliver comprehensive patient centric care for all patients, including those with complex and special needs. Postdoctoral students and Residents can expect a collaborative and robust program with dedicated facilities led by world-class experts who uphold the highest standards of teaching and learning in Prosthodontics, Periodontics, Endodontics, Oral Surgery, Implant Dentistry and Pediatric Dentistry.\nThe program offers a second-year position for postdoctoral students who are interested in an additional year of training. Second-year postdoctoral students will have the opportunity enhance their clinical skills &amp; managment of more complex patients. PGY1 students must submit a Letter of Intent by February 1st to the Postdoctoral Student Affairs office if they are interested in pursuing a second year of training. \nThe Advanced Education in General Dentistry program at the Columbia University College of Dental Medicine provides a broad range of experiences thriough which residents apply evidence based dentistry and the principles of professional ethics as they further advance their clinical skills. In this multidisciplinary and collborative environment, the program builds strong leaders and encourages the continous pursuit of knowledge. Upon graduation, residents will have the ability to deliver high quality patient-centered comprehensive care in their careers.\nThe Columbia University College of Dental Medicine Postdoctoral AEGD certificate program is fully compliant with the accreditation standards set forth by the Commission on Dental Accreditation (CODA).\nThe Advanced Education in General Dentistry program prepares residents to independantly deliver technically proficient and compassionate care, including but not limited to patients with complex and special needs.\nProgram Goals:\n1. Act as a primary care provider for the oral health of patients. This includes: providing emergency and multidisciplinary comprehensive oral health-care; providing patient focused care that is coordinated by the general practitioner; directing health promotion and disease prevention activities; and engaging in community service.\n2. Plan and provide multidisciplinary oral health-care for a wide variety of patients with procedural experiences beyond the predoctoral level, including patients with special needs.\n3. Function effectively within an interdisciplinary health care team and collaborate with other health care providers to deliver oral health care.\n4. Apply scientific knowledge, professional ethics, life-long learning patient centered care and acceptance of cultural diversity in professional practice.\n1. Continue to develop skills in the management and delivery of general dentistry for patients with more complex interdisciplinary needs.\n2. Improve skills in delivery of comprehensive care for patients with missing teeth and need for implant-supported prestheses.\n3. Enhance their ability to apply new knowledge, scientific principles and outcomes of care for decision making and continuous improvement.\nThe College of Dental Medicine professors and staff work to provide real-world clinical &amp; didactic training throughout the AEGD program. Postdoctoral students and residents will provide comprehensive care in a patient centric approach to address and manage active diseases, restorative treatments, aesthetics and function in an appropriate manner. The AEGD program provides ample opportunities for postdoctoral students and residents to collaborate with other health care professionals and apply scientific knowledge, professional ethics, and the skills required to maintain life-long learning in their practice.\nPostdoctoral students and residents will gain knowledge in the following areas:\n1. Advanced diagnosis and treatment planning\n2. Complex prosthodontic treatment\n3. Endodontic therapy\n4. Evaluation and treatment of dental emergencies\n5. Management of pain and anxiety\n6. Medical emergencies management\n7. Operative dentistry / esthetic dentistry\n8. Oral mucosal disease\n9. Oral surgery\n10. Pediatric dentistry \n11. Periodontics therapy\n12. Surgical and restorative aspects of implant dentistry\n13. Treatment of medically compromised and special needs patients\n14. TMD disorders\nRotations\nThe AEGD Program collaborates with various departments within the College of Dental Medicine to provide oral health community services for pediatric and geriatric populations.  Postdoctoral students and residents rotate through a variety of treatment areas, treating patients with special needs, temporomandibular disorders, facial pain, and oral pathology conditions. Postdoctoral students and residents also gain experience managing pain and anxiety pharmacologically.\nRequirements\nIn accordance with our standards of excellence, accepted applicants must adhere to the rules and bylaws of Columbia University Health Sciences and New York Presbyterian Hospital. To qualify for the AEGD certificate, postdoctoral students and residents are required to attend all didactic and clinical sessions in their schedule, manage all cases in their portfolio and pass all academic courses and clinical competencies. Ongoing evaluations will include reviews of each resident’s patient roster and portfolio. Postdoctoral students and residents will also be assessed on their clinical experience, patient management, and clinical competencies. Postdoctoral students and residents must keep logs of their experiences during rotations with other departments, and describe their learning during triannual assessments with the faculty. \nResidents are eligible for all Columbia University holidays and are granted 20 days of vacation each academic year. To request time off, residents must submit a vacation request at least one month in advance. No vacations will be granted in June. \nCurriculum\nThe Columbia AEGD program’s comprehensive curriculum covers core and complex competencies, offering residents a foundation both broad and deep for their career in dental medicine.\nCourses\n1. Advanced Implantology\n2. Advanced Radiology\n3. Basic Implantology\n4. Cariology\n5. Clinical Stomatology Conference\n6. Ethics\n7. Physical Diagnosis\n8. Practice Management/Jurisprudence\n9. Oral Biology\n10. TMD Disorders / Management of pain and Anxiety\nIn addition, residents will meet weekly in the Seminars in Dentistry course for evidence-based approaches to operative dentistry, occlusion, orthodontics, Invisalign training, removable prosthodontics, fixed prosthodontics, endodontics and periodontics. Residents will also participate in weekly case discussions, case presentations, and literature reviews.\nClinical Competencies\nResidents will achieve several clinical competencies, varying by year in the program.\nFirst year\nThe first year focuses on core competencies:\nSecond year\nThe second-year competencies focus on the management of more complex interdisciplinary care:\nDue to heavy call volume, please send all inquiries to cdm-pgadmissions@cumc.columbia.edu.", "Program Name": "Columbia University College of Dental Medicine (Residency)", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.dental.columbia.edu/education/postdoctoral-and-residency-programs/advanced-education-general-dentistry-program-aegd", "keywords": ["clinical competencies", "advanced education", "continuous improvement", "comprehensive care", "predoctoral level", "oral surgery", "advanced implantology", "continous pursuit", "complex interdisciplinary", "oral biology"]},
{"objectID": "0d65bb83d2d98fdc268ae5dc9fe042bf", "title": "Advanced Education in General Dentistry Program - Adams School of Dentistry : Adams School of Dentistry", "body": "Application Deadline: October 1\nApplicants must utilize the Postdoctoral Application Support Service (PASS) administered by the American Dental Education Association.\nClick here to access the PASS application materials and instructions.\nApplication to the UNC-Chapel Hill Graduate School is required prior to being accepted into the program. Applications are accepted on or after May 13. \nSupplemental Materials\nAll prospective students must hold a DDS, DMD or equivalent degree from a dental school. The program is unable to accept international students or students with advanced standing at this time.\nAdmission criteria are applied equally to all applicants regardless of race, sex, color, national origin or religion. Minority students are encouraged to apply.\nThe Adams School of Dentistry does not employ “in-state” quotas; all candidates are reviewed on a competitive basis.\nThe AEGD Program does not charge students for tuition and fees.\nResidents are provided a stipend, contingent on the availability of funding, for the postdoctoral year which is paid on a monthly basis. For FY 2021-22, the annual stipend is $34,000. Regardless of the availability of financial support, teaching responsibilities are a part of the graduate program.\nStipend support is considered as taxable income and consequently subject to appropriate federal and state tax liability.\nMalpractice insurance premiums for all resident trainees are paid through institutional resources. This coverage only pertains to clinical care rendered in association with the educational program.\nEach resident will be offered two weeks (10 working days) of paid vacation for the year of residency. These days may be taken at the resident’s discretion (vacation, sick leave, professional leave) once program responsibilities have been addressed and coverage by classmates, when required, has been arranged. Residents receive time off for all holidays observed by the university.\nThe Adams School of Dentistry is a nationally recognized leader in providing for lifelong learning. Residents are provided tuition-free access to continuing education courses occurring at the Adams School of Dentistry assuming certain contingencies are met. Access to continuing education courses is on a “space available” basis after paid enrollment is closed. The AEGD program director and the sponsoring department must approve the resident enrollment.\nThe primary clinical training site is at the Kernersville Veteran’s Administration (VA) Dental Clinic located in Kernersville, North Carolina (approximately 39 weeks) with the remaining time spent at the Adams School of Dentistry for didactic training along with specialty clinical rotations.\nPrimarily utilizing the seminar format as well as the ability to audit formal courses, didactic offerings are made in the areas of physical evaluation, diagnosis and treatment planning, prevention, periodontics, operative dentistry, prosthodontics, TMD, dental implants, oral surgery, anxiety and pain control, endodontics, special needs patients, literature review, and practice management. AEGD residents are expected to take an active role in these presentations and in many cases will be called upon to lead seminar sessions.\nA major focus of clinical training is to enhance the resident’s ability to make judgments in diagnosis, treatment planning and decision-making during the course of treatment. Residents administer comprehensive dental care to ambulatory outpatients, which include the elderly, chronically ill, emotionally, developmentally or mentally disabled, handicapped, and highly medicated individuals.\nOMSU 720 Applied Pharmacology\nDENG 707 Regional Anatomy\nPERI 820 Introduction to Implants\nOBIO 724 Diagnosis and Treatment of Orofacial Pain\nPERI 821 Clinical Implantology\nPlease note, the curriculum includes seminars given by various expert speakers on selected topics throughout the year.\nQuestions?\nContact Ana Cecilia Suarez: 919.445.0323, anac@live.unc.edu\nMeet the Program Director, Christine Downey, DDS, MS", "Program Name": "University of North Carolina at Chapel Hill Adams School of Dentistry", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dentistry.unc.edu/advanced-dental-education/aegd/", "keywords": ["aegd program", "regional anatomy", "dental implants", "aegd residents", "international students", "formal courses", "dental clinic", "orofacial pain", "taxable income", "competitive basis"]},
{"objectID": "4d4360484c50b661189acbd63536f62f", "title": "Advanced Education in General Dentistry - Venice | UCLA Dentistry", "body": "Length of Program: 1 year\nNumber of Positions: 6 \nFinancial Arrangement: UC Salary Breakdown\nProgram Director: Dr. Thomas Lee\nAs a satellite clinic of the UCLA School of Dentistry, the Venice Dental Center provides comprehensive care with minimal referral to outside providers. Residents provide broad cross-disciplinary treatment under the supervision of specialist and general dentist faculty, including: implant placement and restoration, guided tissue regeneration and sinus augmentation, periodontal surgery and soft tissue grafting, exodontia, endodontics, and full mouth rehabilitation. The vast majority of patient care provided by postgraduate residents is comprehensive, with additional substantial experience in triage and treatment of dental emergencies, and referrals from students and private dentists for specialist procedures. Faculty coverage is provided primarily by general dentists, with additional coverage by specialists in periodontics, endodontics, and oral and maxillofacial surgery. The weekly schedule involves 40+ hours in clinic, classes, and seminars.\nThe UCLA Venice Dental Center has been committed to providing quality dental care for the underserved community since its inception in 1969. Over time, the large volume of patients with complex needs led to the addition of postgraduate dental training. This advanced training has evolved into a 1-year AEGD residency program with an emphasis on comprehensive community-based dentistry.\nThis program is designed primarily for general dentists within their first 5 years of clinical practice who want to:\nLearn and implement advanced treatment planning concepts for complex cases\nDevelop proficiency in all aspects of dental practice\nBecome confident treating patients with minimal specialist referral\nGain experience using contemporary technologies (e.g. all-ceramic and CAD/CAM restorations, digital impressions, implant placement and restoration, and digital radiology)\nSelected candidates will be invited to interview. If you have been selected, you will be contacted by email and/or telephone.\nTiming of Interviews: November – December\nThe admissions committee considers the following criteria in its decisions:\nAcademic achievement\nContent of personal statement\nContent of recommendation letters (4 Professional Evaluation Forms and 1 Institutional Evaluation Form required)\nProficiency in clinical dentistry\nCommitment to further learning and professional growth\nCommunication skills\nPersonal interview\nApplicants will be notified of acceptance through the Match service. To find out when results will be available, please consult the Match service. A letter of acceptance signed by the Program Director and Associate Dean of Academic Affairs will be issued upon acceptance.\nThe program in Advanced Education in General Dentistry - Venice is accredited by the Commission on Dental Accreditation of the American Dental Association and has been granted the accreditation status of \"Approval without Reporting Requirements”. The Commission is a specialized accrediting body recognized by the United States Department of Education. The Commission on Dental Accreditation can be contacted at (312) 440-4653, by visiting www.ada.org/coda, or by mail at 211 East Chicago Avenue, Chicago, IL 60611-2678.\nNotice to Trainees re: Professional Licensure and Certification\nUniversity of California programs for professions that require licensure or certification are intended to prepare the student for California licensure and certification requirements. Admission into programs for professions that require licensure and certification does not guarantee that students will obtain a license or certificate. Licensure and certification requirements are set by agencies that are not controlled by or affiliated with the University of California and licensure and certification requirements can change at any time.\nThe University of California has not determined whether its programs meet other states’ educational or professional requirements for licensure and certification. Students planning to pursue licensure or certification in other states are responsible for determining whether, if they complete a University of California program, they will meet their state’s requirements for licensure or certification. This disclosure is made pursuant to 34 CFR §668.43(a)(5)(v)(C).", "Program Name": "University of California, Los Angeles - Venice Clinic", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dentistry.ucla.edu/academics-admissions/postgraduate-and-residency-training-programs/advanced-education-general-dentistry-venice", "keywords": ["minimal referral", "dental practice", "academic achievement", "personal statement", "general dentist", "academic affairs", "dental emergencies", "digital radiology", "professional evaluation", "dental training"]},
{"title": "NYU Langone Dental Medicine - Foundry Dental Center, Bessemer, AL / Advanced Education in General Dentistry (12 months)", "active": false},
{"objectID": "01d4d0271aefdef5c44897fa5e3a5d78", "title": "Certificate in Advanced Education in General Dentistry | School of Dentistry", "body": "Catalog Information\nThe advanced education program is designed to refine and advance knowledge, skills and clinical competency and proficiency in the practice of comprehensive general dentistry. It bridges the gap between dental school and dental practice. Clinical instruction is offered in all of the clinical disciplines. The didactic component provides postgraduate training in the basic and behavioral sciences, as well as the clinical sciences and practice management. It is a 12-month program that begins July 1 of each year.\nFIRST STEP – IMPORTANT INFORMATION – Review this document before proceeding.  \n© 2021 School of Dentistry\n                University of Missouri-Kansas City\n                650 E. 25th St.\n                Kansas City, MO 64108\n                (816) 235-2100", "Program Name": "University of Missouri-Kansas City, School of Dentistry", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dentistry.umkc.edu/academics/certificate-in-advanced-education-in-general-dentistry/", "keywords": ["dental practice", "general dentistry", "important information", "first step", "didactic component", "clinical disciplines", "clinical instruction", "clinical sciences", "advanced education", "dental school"]},
{"objectID": "e26143a436276da73f3506a8da02269a", "title": "Advanced Education in General Dentistry Residency Program (UC Health Dental Center) | UC Health", "body": "The Dental Center at University of Cincinnati Medical Center is state-of-the-art, featuring direct and indirect digital radiography, digital impressioning, CBCT, and intra-oral cameras. The facility includes ten treatment rooms, in addition to support areas such as a conference room, residents’ room, lab and sterilization room. Construction of the 7,500 sq. ft. Dental Center was completed in April 2021.\n\n\n\nThe Advanced Education in General Dentistry Residency Program at  University of Cincinnati Medical Center is a one-year educational program and is the only general dental residency program in the Greater Cincinnati area. The program provides clinical, didactic and hospital experience at the postdoctoral level. This experience will prepare residents for the practice of comprehensive general dentistry. Residents will receive a certificate of completion at the end of the term.\nThe Advanced Education in General Dentistry Program is accredited by the Commission on Dental Accreditation and has been granted the accreditation status of approval without reporting requirements. The Commission is a specialized accrediting body recognized by the United States Department of Education. The Commission on Dental Accreditation can be contacted at 312-440-4653, 211 East Chicago Avenue, Chicago, IL 60611 or www.ada.org.\nThere is no tuition associated with the certificate program. Residents receive a stipend and are eligible for full benefits through UC Health, including medical and dental insurance, life insurance and long-term disability and professional liability insurance. Residents may also choose to participate in a 401(k) retirement plan and flexible spending accounts for health care and dependent daycare. The current resident stipend for 2021-2022 is $60,203.\nThe Advanced Education in General Dentistry program provides educational training and hospital experience in all aspects of comprehensive general dentistry. Some highlights of the program include:\nIn addition to the full-time dentist staff, the Dental Center has a number of part-time attendings from the local dental community. This part-time attending staff provides a wealth of experience with a private practice perspective. Our part-time attendings have assigned clinical time for supervision of resident patient care and resident education. They include two endodontists, two periodontists, a prosthodontist, and four general dentists. The pediatric dentistry and oral and maxillofacial surgery programs provide specialist attending coverage when an AEGD resident is on rotation to those services.\nThe Dental Center has more than adequate staffing to support resident education and patient treatment. This includes front desk staff, an insurance/billing coordinator and dental assistants. Each AEGD resident has an assigned dental assistant for all patient care in the Dental Center. Additionally, a residency program coordinator is on staff for administrative support of the AEGD program and resident education.\nThe residency training program will enable the resident to:\nAct as a primary oral health care provider:\nAssess, diagnose and plan for the provision of multidisciplinary oral health care for a wide variety of patients including patients with special needs.\nManage the delivery of patient-focused oral health care.\nRestore intra and extra coronal defects in primary and permanent teeth, including endodontically treated teeth, with a range of materials and methods.\nTreat the partially edentulous patient with fixed, removable and/or implant supported prostheses; treat the completely edentulous patient with removable and/or implant supported prostheses.\nDiagnose and treat mild to moderate periodontal disease using non-surgical and surgical methods, evaluating the results of periodontal treatment.\nManage advanced periodontal disease and periodontal maintenance.\nDiagnose and treat pain of pulpal origin by performing non-surgical endodontic therapy in the primary and permanent dentition.\nPerform non-surgical and surgical extractions.\nEvaluate and treat patients with dental emergencies, including post-operative complications from dental treatment, pain, infection and/or trauma.\nProvide control of pain and anxiety in the conscious adult and pediatric dental patient through the use of behavior management techniques and pharmacological techniques (local anesthesia, oral/nitrous oxide anxiolysis).\nRecognize, diagnose and provide initial treatment for medical emergencies that may occur in the dental office.\nDiagnose and manage common oral pathologic conditions.\nDiagnose and manage temporomandibular disorders, orofacial pain and occlusal disorders.\nApply the principles of ethical reasoning, ethical decision making and professional responsibility as they pertain to patient care, and practice management.\nApply the principles of practice management to everyday dental practice.\nTake, record, and interpret a complete medical history (incorporating any physical evaluation performed by a physician) with an understanding of how it impacts on proposed dental treatment.\nThe OMS Center at Holmes Hospital is on the campus of University of Cincinnati Medical Center.  The Center is home to an OMS residency program.  AEGD residents rotate to the OMS service one-half day per week for the entire year.  While on this rotation, the AEGD resident works along side the OMS residents doing consults, post-ops and exodontia, with supervision provided by the OMS faculty attendings.  In addition, the AEGD resident will be exposed to major oral surgery procedures in the operating room environment.\nCincinnati Children’s Hospital Medical Center (CCHMC) is across the street from University of Cincinnati Medical Center.  The CCHMC dental clinic is home to a pediatric dentistry residency program.  AEGD residents rotate to the pediatric dentistry service one-half day per week for the entire year.  While on this rotation, the AEGD resident works along side the pediatric dentistry residents doing routine pediatric dentistry including behavior management, preventive, restorative and surgical procedures, with supervision provided by the pediatric dentistry faculty attendings.  In addition, the AEGD resident will gain experience in the treatment of pediatric dental patients in the operating room environment.\nAEGD residents spend a two week rotation with the anesthesia service at University of Cincinnati Medical Center.  During this rotation, the AEGD resident works with anesthesia residents and faculty attendings to perform a variety of anesthesia related procedures such as IV placement and simple intubations.  Additionally, the AEGD resident will learn airway management, monitoring techniques and medications used in anesthesia.\nUniversity of Cincinnati Medical Center and UC Health are equal opportunity employers. We strive to ensure equal access to workplace opportunities for all individuals, based on merit, without regard to any dimension of their diversity. Creating a diverse workforce, reflective on all levels of the demographic organizations of both our community and the available, qualified candidate pool, is a top priority of University of Cincinnati Medical Center and of UC Health.", "Program Name": "University of Cincinnati Medical Center", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.uchealth.com/education/dentistry-residency-program/", "keywords": ["aegd program", "dental practice", "orofacial pain", "patient care", "resident patient", "wide variety", "aegd residents", "private practice", "dental clinic", "top priority"]},
{"objectID": "29079191a241505dbab325dce65dbb4a", "title": "AEGD - School of Dental Medicine - University at Buffalo", "body": "Our program offers two distinct options based on the candidate’s dental training.  Application procedures are different for each.\nThe application cycle will run from May 12 - October 15\n&gt; Application for North American DDS/DMD Candidates\nThe application cycle will run from July 1 - October 31.\nFor admission to the AEGD program, international candidates must apply to two programs via the UB Application system:\n        &gt; Biomaterials          &gt; Oral Sciences\nCandidates for the AEGD International Scholars Program must demonstrate English language proficiency.  Acceptable documentation includes the TOEFL (score 79+) or IELTS (overall 6.5+) and scores must be less than two years old at the time of admission.\n--&gt; More Information\nThis program is designed to reflect a private general practice setting as closely as possible. While this program is not a fifth year of dental school, its location within the School of Dental Medicine offers several advantages including an excellent faculty/resident ratio and access to all specialties.\nThe program provides advanced training beyond the level of predoctoral education in clinical dentistry and applied basic and behavioral sciences.  During this program, students can refine the skills necessary for the generalist to provide comprehensive patient care for all population groups.  This is a planned, sequential postdoctoral training program that is specifically designed to meet the needs of graduates who want to enhance their skills as general practitioners.  The program is a supplement to the predoctoral curriculum, but is not a required component of that educational sequence.\nStudents receive both clinical experience and didactic training, including implant training and experience in both surgery and restoration.\nEach resident is assigned one dedicated operatory with added charges available as needed.  Residents work closely with hygienists in the school’s Oral Hygiene Recall program. Assistance from a certified dental assistant for any procedure is available when necessary. Due to the fluctuating number of providers in the clinic at any one time, we do not always have a 1:1 ratio, but we make every effort to assure efficient utilization of support staff.\nWe encourage visits from prospective students, and we are actively looking for students from institutions other than our own.\nThe program in advanced education in general dentistry is accredited by the Commission on Dental Accreditation and has been granted the accreditation status of accredited without reporting requirements. The Commission is a specialized accrediting body recognized by the United States Department of Education. The Commission on Dental Accreditation can be contacted at (312) 440-4653 or at 211 East Chicago Avenue, Chicago, IL 60611. The Commission’s web address is www.ada.org/en/coda.\nTypically this is a one-year program, but an optional second year is also offered; the second year expands on the knowledge and experience obtained in the first year. This second year option is only available to those currently enrolled in our first year program.  \nFaculty is one of the greatest assets of the AEGD program. All general dental faculty members have experience in private practice, and there is access to faculty in every dental specialty. Two dedicated faculty members are assigned at each clinic session, and the ratio of faculty to residents is 1:5 or better. The program relies on more than 35 associated faculty members, with supervising faculty whose only responsibility is resident instruction.\nFaculty may include those who are:\nThe curriculum is designed to provide advanced training beyond pre-doctoral education in clinical dentistry. Students will refine those skills necessary to provide comprehensive patient care for all population groups.\nAvailable experience includes:\nAEGD Residents are selected from students who have completed a course of study in a CODA-accredited dental school and who have graduated with a DDS or DMD degree. Six traditional positions are offered annually, pending the number of residents who are accepted in the optional second year.\nAEGD Residents receive a salary during their year of training.\nThe School of Dental Medicine established the International Advanced Education Scholar Program with the goal of promoting and improving the level of dentistry at other dental institutions around the world. Through this program, current and future faculty members supported by their institutions (dental schools, hospitals and government institutions) can receive advanced education training along with MS and/or PhD degrees. The AEGD Program participates in the International Scholars Program.\nAEGD International Scholars: \nOne or two international scholars are typically accepted each year.\nApplicants will be evaluated on the basis of their past academic record, their demonstrated interest in pursuing general dentistry as a career, and a personal interview.  Applicant integrity, motivation, industry, resourcefulness, and background knowledge will be subjects of discussion during the interview.\nAEGD Residents are selected from students who have completed a course of study in a US or Canadian, CODA/CDAC-accredited dental school and who have graduated with a DDS or DMD degree. Applicants must have a New York State License, or be eligible for a New York State Limited Permit to Practice Dentistry.\nCandidates must meet all requirements, including deadlines, of the PASS Application process as published by PASS. All North American DDS/DMD degree candidates should apply through PASS. The AEGD program participates in both the Postdoctoral Application Support Service (PASS) and the National Matching Service (NMS). Applicants must complete and submit the PASS Application and also register for the Match through the PASS website. No independent applications are accepted.\nCandidates accepted by the AEGD program must submit an official, final transcript along with a copy of their diploma upon dental school graduation.\nInternational Scholars DO NOT use PASS\nAEGD International Scholars must concurrently pursue a research program; this is customarily an MS in either Oral Sciences or Biomaterials. Applications to AEGD will be considered incomplete unless an application has been made to one of the research programs (Biomaterials or Oral Sciences).\nImportant Application Instructions:\nA MINIMUM of 5 letters are needed to complete an application \n1. EVERY candidate MUST submit a letter from the applicant's institution.  The letter must confirm academic and financial support from their employer/institution indicating that the student will return to the home institution after program completion. \n2. EVERY candidate MUST have three Letters of Recommendation PLUS a letter signed by the school's Dean or designee.\n(See submission instructions below)\nTo apply for the AEGD International Scholars program please submit all documents listed below on-line via the UB application. Your application will not be complete until these items have been received and you have submitted your application for review.\nOnce you have submitted your online application for review, you will be able to pay the application fee by credit/debit card.  A payment link will be accessible via the applicant portal once you submit your application.  Your application cannot be reviewed until the fee has been paid. Please note that the application fee is non-refundable. \nIf you are accepted into the program you will be asked to submit original transcripts with proper signatures, seals or stamps. Academic documents that are not in English must be accompanied by an exact, certified translation; ECE course-by-course report is preferred.  Please include copy of certificate with proof of degree.\nTOEFL score report must be at or above minimum of 550 (written) / 213 (computer based) / 79 (internet based) or better obtained within eighteen months of the application deadline. An official score report must be provided upon acceptance.  UB’s School Code is: 2925.\n* All documents become property of the University at Buffalo School of Dental Medicine and are not returnable to the applicant.\nAdvanced Education Admissions\n\n\nFax: 716-829-2731\nEmail: sdmpg@buffalo.edu", "Program Name": "University at Buffalo School of Dental Medicine", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dental.buffalo.edu/education/advanced-education/aegd.html", "keywords": ["excellent faculty", "aegd program", "academic documents", "aegd residents", "private practice", "final transcript", "international scholars", "dental assistant", "predoctoral curriculum", "dental training"]},
{"objectID": "8b280dde822597c05435f8a2a229fd82", "title": "Advanced Education General Dentistry Certificate (Graduate) | Temple University", "body": "Expand your knowledge and refine your clinical competency and judgment with a 12-month graduate certificate program in Advanced Education in General Dentistry (AEGD) from Temple University’s Kornberg School of Dentistry.  The program is designed to accommodate six recent dental school graduates who function in the program as residents as well as applicants who hold a DMD or DDS degree from a Commission on Dental Accreditation (CODA) accredited dental school. Dentists who hold a BDS, DMD or DDS from an international dental school not accredited by CODA may apply to the AEGD program for international dentists.  \nThe field of dentistry is rapidly evolving, with new restorative technologies being pioneered and patients who live longer and have more complex medication and healthcare needs. The program takes you beyond the four-year DMD curriculum and strengthens your knowledge base and clinical judgment, helping you keep pace with advances in the field. While primary patient care provides the majority of residents’ learning experience, you’ll also further enhance your diagnostic skills and ability to develop patient-appropriate treatment plans through the didactic curriculum and weekly seminars covering treatment planning, literature reviews and topics in general dentistry.\nResidents train to operate effectively and collaborate efficiently within cross-functional healthcare teams while honing their ability to provide emergency, multidisciplinary and patient-centered oral healthcare to a diverse community of patients with a broad spectrum of conditions and needs.\nCertificate students acquire robust clinical experience by working in the AEGD Clinic, which operates as a stand-alone clinic with a staff of dental assistants and hygienists. Rotations in postgraduate endodontology and periodontology and implantology supplement the comprehensive patient care assignment in the AEGD clinical facility. Dedicated faculty, who are experts in their fields and who are full-time, tenured members of the Department of Restorative Dentistry, instruct and support residents throughout their clinical development and treatment of complex cases.\nThe Kornberg School of Dentistry offers a postgraduate opportunity for dentists who hold a BDS, DMD or DDS degree from an international dental school not accredited by CODA. This comprehensive program includes both clinical and didactic training, and the flexibility to attain an optional Oral Health Sciences MS. \nResidents in this one-year program also have the flexibility to pursue an optional second year of AEGD training and/or to earn an optional Master’s of Science degree in Oral Health Sciences. Those interested in the optional MS degree must apply to both the first-year AEGD and MS programs concurrently. If accepted to both programs, the tuition for the MS degree program will be included in the AEGD tuition. Learn more about how to apply to the AEGD program for international applicants.\nThis AEGD program begins in July and runs through the following June. The tuition cost for this program is a flat fee of $69,398 plus a $4,500 instrument fee. These prices are subject to change for upcoming academic years in accordance with the University’s changes in tuition. International dentists who have not already completed a DMD or DDS degree from a CODA-accredited institution are not able to be considered for the stipend-based AEGD program.\nThe AEGD program has a 15-chair clinical facility that includes \na fully equipped dental laboratory, \nexpanded dental operatories, \ninstrument and materials storage,\nradiology capability, \nresident office space, \nsterilization area, and\nwaiting room and front desk space.\nLearn more about facilities in the School of Dentistry.\nWhile most of the courses residents complete focus on primary patient care, the weekly didactic curriculum includes literature review, treatment planning, general dentistry and prosthodontics seminars. \nThe Advanced Education in General Dentistry program includes didactic instruction over a 12-month period. Core courses include\nLearn more about coursework for the Advanced Education in General Dentistry certificate program.\nRecipients of the Advanced Education in General Dentistry Certificate are prepared to become\nThrough the Office of Student Affairs, students pursuing careers in dentistry can get counseling and support during their tenure at Kornberg and after they graduate. The office regularly hosts career events and guest speakers covering a wide range of topics including\nOnce enrolled in the program, you will receive regular notifications about career opportunities. Additionally, the school provides an updated list of job opportunities for dental professionals across the U.S.\nIn keeping with Temple’s commitment to access and affordability, this Certificate in Dentistry offers a competitive level of tuition with multiple opportunities for financial support.\nTuition rates are set annually by the university and are affected by multiple factors, including program degree level (undergraduate or graduate), course load (full- or part-time), in-state or out-of-state residency, and more. \nLearn more about the tuition rates for the 2021–2022 academic year.\nMarc Herman is the director of the AEGD Program.Email: marc.herman@temple.edu\nThe program in advanced education in general dentistry (12 months/optional second year) is accredited by the Commission on Dental Accreditation [and has been granted the accreditation status of “approval without reporting requirements”]. The commission is a specialized accrediting body recognized by the United States Department of Education. The Commission on Dental Accreditation can be contacted at 312-440- 4653 or at 211 E. Chicago Ave., Chicago, IL, 60611. The commission’s web address is ada.org/en/coda. \nThe Commission on Dental Accreditation has accredited the program in advanced education in general dentistry (12 months/optional second year). However, accreditation of the program does not in itself constitute recognition of any dental specialty status.", "Program Name": "Temple University, Kornberg School of Dentistry", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.temple.edu/academics/degree-programs/advanced-education-general-dentistry-certificate-graduate-dn-aegd-dent", "keywords": ["aegd program", "multiple opportunities", "comprehensive program", "regular notifications", "aegd program.email", "appropriate treatment", "advanced education", "flat fee", "oral healthcare", "academic year"]},
{"objectID": "15a510f18d08b6ba878056e79676c923", "title": "Advanced Education in General Dentistry (AEGD) | School of Dental Medicine | Case Western Reserve University", "body": "The AEGD Program is a 12-month certificate program providing extensive training in General Dentistry and emphasizes treatment planning, patient management and comprehensive care. The program provides didactic and clinical training in restorative dentistry, esthetic dentistry, endodontics, periodontics, full mouth rehabilitation, and implant dentistry (both surgical and restorative) to mention a few.\nThe experience is enhanced with relevant hospital exposure through the affiliation with University Hospitals of Cleveland. Along with its didactic curriculum, the program offers a variety of Continuing Education opportunities on a variety of subjects, and encourages individual achievements and life-long learning. It is staffed with dedicated full-time and volunteer faculty as well as an outstanding staff.\nThe AEGD Clinic offers state-of-the-art dental services in all areas of general and specialized dentistry. We offer placement and restoration of dental implants, full mouth reconstruction, restorative dentistry, cosmetic dentistry, root canal therapy, periodontal therapy, orthodontic therapy, and extractions. In our focus on comprehensive care for our patients, we use current technologies like CEREC, laser therapy, NobelClinician software, digital x-rays, and the teeth in a day process. For more information about the AEGD Clinic or how to become a patient, call 216.368.3290.\nAEGD residents were awarded first and third place in the table clinic competition at the Ohio Dental Association (ODA) annual session held in Columbus OH. Mohamad Othman, Abdulaziz Al-zahrani, and Steve Wang won first place for “Rationale for Socket Preservation in Implant Dentistry,” their project showing that socket preservation procedures at the time of tooth extraction improve the prognosis regarding maintenance of the width and height of remaining bone. Also socket preservation can lead to more successful implant-supported restorations, with reduced treatment time overall. Joe Merci and William Chin were awarded third place for their presentation, “Stretching Bone to Allow Dental Implant Placement Increase Alveolar Bone Height Using Distraction Osteogenesis (DO),” where Drs. Merci and Chin reviewed the current literature on Distraction Osteogenesis (DO) with different types of DO devices available today and compared them to conventional methods used in gaining bone. DO showed more bone gain on average and a higher success rate when compared to other methods.", "Program Name": "Case Western Reserve University", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://case.edu/dental/departments-programs/advanced-education-general-dentistry-aegd", "keywords": ["aegd program", "alveolar bone", "dental implants", "aegd residents", "different types", "outstanding staff", "periodontal therapy", "third place", "annual session", "comprehensive care"]},
{"objectID": "1dbd08364c3cd62a949eb5c4348598fa", "title": "", "body": "The Advanced Education in General Dentistry (AEGD) program is one of several residency programs offered at the University of Oklahoma College of Dentistry, providing you the tools to propel your career in dentistry forward.   \n\t\t\t\nThis comprehensive program is designed to enhance your clinical skills and productivity and is an excellent preparation for those looking to open a private practice.\n\t\t\t\n                                                                                Apply\n\nLearn more about becoming a patient today!\n\nAs an AEGD resident, you will provide comprehensive care to a varied community and spend approximately 80 percent of the program involved in direct patient care in a group practice environment. From routine check-ups to placing and restoring dental implants, each day will offer new and complex challenges.\n\nAEGD students train and perform procedures in renovated facilites that incorporate the latest in clinical and research technology. \n\nView the current residents in AEGD. \n\nOklahoma City offers all of the culture, cuisine, attractions and amenities you'd expect in a modern metropolis and continues to grow at a rapid pace. Our campus is just a few minutes from the city center and nearby Bricktown, an early-day warehouse area transformed into one of the fastest growing entertainment district in the Southwest. Next door is the Chesapeake Energy Arena, home to the Oklahoma City Thunder NBA team, live concerts and world-class events. \nFor more information and things to do in Oklahoma City: visitokc.com\nCONTACT\n\nOU COLLEGE OF DENTISTRY1201 N. STONEWALL AVE.OKLAHOMA CITY, OK 73117 \n\nCOMMUNICATIONS CENTER(405) 271-7744\n\nHOURS\n\nMONDAY - FRIDAY8 A.M. - 5 P.M.\n\nPARKING \n\nPatient and visitor complimentary parking is available in the Stonewall Garage (P4). Please bring your parking ticket with you to check-in or check-out for validation. \n\nCOURTESY SHUTTLE\n\n7:45 A.M.-4:45 P.M. (M-F)\n\nPick up and Drop off LocationsStonewall garage (first floor near garage entrance)\n\nCollege of Dentistry Main Entrance (South side)", "Program Name": "University of Oklahoma College of Dentistry", "Program Type": "Advanced Education in General Dentistry (12 month) - Optional 2nd Year", "url": "https://dentistry.ouhsc.edu/Academic-Programs/Advanced-Education-in-General-Dentistry", "keywords": ["dental implants", "private practice", "comprehensive program", "clinical skills", "advanced education", "comprehensive care", "main entrance", "rapid pace", "next door", "complimentary parking"]},
{"objectID": "338375ec94fab4642e7050bee8e04389", "title": "AEGD | School of Dentistry", "body": "", "Program Name": "University of Texas Health Science Center at San Antonio", "Program Type": "Advanced Education in General Dentistry (12 month) - Optional 2nd Year", "url": "https://www.uthscsa.edu/academics/dental/programs/aegd-advanced-dentistry", "keywords": []},
{"objectID": "e4fe0d4b80677905f70c923e8145566f", "title": "Advanced Education General Dentistry (AEGD) - Dental Education - Eastman Institute for Oral Health - University of Rochester Medical Center", "body": "", "Program Name": "University of Rochester Eastman Institute for Oral Health", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.urmc.rochester.edu/dentistry/education/advanced-education-general-dentistry.aspx", "keywords": []},
{"objectID": "86a98821add6987f5fa80e657ac71e85", "title": "Northwest Dental Residency (AEGD) | Yakima Valley Farm Workers Clinic", "body": "", "Program Name": "Northwest Dental Residency", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.yvfwc.com/residencies/northwest-dental-residency/", "keywords": []},
{"objectID": "02a8523afec44015c93e4cfc12510937", "title": "General Practice Residency (GPR) & Advanced Education in General Dentistry (AEGD) Postdoctoral Programs - School of Dentistry | UAB", "body": "AEGD - September 1 GPR-UH - September 1 AEGD-VA - October 1\nAlthough each program has a separate accreditation by the American Dental Association, its six residents are functionally integrated into a single general dental residency. The program focuses on ensuring competence in providing advanced comprehensive care to the dental patient who has complex medical diagnoses and/or special needs. The General Dental Residency also provides dental care for UAB Hospital inpatients and interacts with multiple hospital medical departments that are seeking dental consultation. The main clinical activity for the combined program occurs in the Hospital Dental Clinic in the UAB Hospital. This program also takes responsibility for most of the oral medicine components of the D.M.D. curriculum.\n\n\nProgram Director:Dr. Christine Blass (205) 934-4178\nLength of Program: 1 year\nMatch Participant: Yes\nPass Participant: Yes\nCertificate Awarded: Yes\nDegree Awarded: No\nStipend Available: Yes\nTuition/fees: None\nInternational Students Accepted: Canada Only\nApplication Deadline: September 1\nProgram Start Date: July 1 (mandatory orientation 1 week prior to start date)\nApplication Materials Required:\nApplication Fee: Pay the $25 postdoctoral application processing fee online.\n\n    Acceptance Deposit Fee: A $250 non-refundable deposit is due upon acceptance to the program. Please pay this deposit only when directed to do so by the School of Dentistry. Pay the acceptance deposit fee.\n\nProgram Director:Dr. Christine Blass\n(205) 934-4178\nLength of Program: 1 year\nMatch Participant: Yes\nPass Participant: Yes\nCertificate Awarded: Yes, (2) 1 - hospital, 1 - dental school\nDegree Awarded: No\nStipend Available: Yes\nTuition/fees: None\nInternational Students Accepted: Canada Only\nApplication Deadline: September 1\nProgram Start Date: July 1 (mandatory 1 week prior to start date)\nApplication Materials Required:\nApplication Fee: Pay the $25 postdoctoral application processing fee online.\n\n    General Practice Residency (GPR) \nand \nAdvanced Education in General Dentistry (AEGD) Programs\n\nCo-Sponsored by the University of Alabama School of Dentistry and The University of Alabama Hospital\nUniversity of Alabama at Birmingham\nBirmingham, Alabama\n\n\n    The General Practice Residency (GPR) and the Advanced Education in General Dentistry (AEGD) merged in July of 2000 to form a single program known as the General Dental Residency (GDR). This is a two-track program with a GPR track with four 4 residents and an AEGD track with 2 residents. Both programs share clinical facilities, have the same auxiliary staff, utilize the same attending faculty and share didactic lectures. All 6 GDR residents rotate in OMFS for 6 weeks divided into two three-week rotations; Emergency Medicine for 2 weeks; 2 weeks in Otolaryngology; 1 week in Radiation/Oncology and have a 1 week elective rotation in a medical or dental specialty. The 4 GPR track residents rotate in Anesthesia for 2 weeks and the AEGD track residents rotate in Pediatric Dentistry for 2 weeks. We believe this merger emphasizes the strengths of both programs – comprehensive general dentistry on patients with complex medical histories. A second year in either program is offered each year for one resident. At the successful completion of the GDR program each resident will receive either a GPR certificate or an AEGD certificate depending upon the track selected.\n\n\n    The General Dental Residency (GDR) Program is a postdoctoral educational program designed to provide essential skills, attitudes, and abilities related to the contemporary practice of advanced general dentistry, with emphasis on total patient care. The program provides the recent graduate the opportunity to augment his/her knowledge of oral disease and his/her diagnostic and therapeutic skills in dentistry. Treatment of oral disease in the medically complex patient and/or hospitalized patient is emphasized. A private practice environment is maintained throughout the program to assist the recent dental school graduate in the transition from academics to “real world dentistry”.\n\n\n    The formal goals and objectives are:\n\n\n    The GDR Program co-sponsored by the University of Alabama-Birmingham School of Dentistry and the UAB Hospital consists of 12 months of advanced dental education in clinical dentistry and is conducted primarily within a hospital environment.  An optional second GPR or AEGD year is available on a competitive basis. This latter position is generally limited to one position per year and is dependent upon qualifications.\n\n\n    Goal 1: Act as a Primary Health Care Provider at a level more advanced than a GPR/AEGD Level 1 resident.\n\n\n    Provide multidisciplinary comprehensive dental care to a wide variety of patients by pursuing training in advanced dental clinical fields of interest including but not limited to:\n\n\n    Goal 2: Obtain more advanced didactic training in both medicine and dentistry. \n\n\n    They will be offered graduate level courses in the following areas:\n\n\n    Goal 3: Complete medical/dental rotations not offered to Level 1 residents. \n\n\n    These may include:\n\n\n    Goal 4: The Level 2 resident will assume more administrative responsibility in the administration of a GPR/AEGD residency.\n\n\n    Goal 5: The Level 2 resident will gain experience in the academics of dentistry. \n\n\n    These experiences will include:\n\n\n    Note: In pursuing these objectives the Level 2 (PG2) resident will not repeat Level 1 (PG1) rotations and academic courses. It is anticipated the Level 2 resident will spend 15% more time delivering clinical dental care. Each Level 2 resident in conjunction with the program director will tailor this Level 2 year to his/her interests.\n\n\n    The program begins July 1st and concludes June 30th. In general, entering residents are required to report approximately the 20th of June for UAB Hospital orientation and help in patient transition (date to be provided after acceptance to the program).\n\n\n    Formal postgraduate courses taken with other post-graduate dental students include Physical Diagnosis, Conscious Sedation, and Dental Management of the Medically Complex Patient.  A portion of most Thursday mornings is set aside for resident seminars that range from formal lectures to treatment planning sessions. At these sessions other issues are discussed relating to the clinic practice (scheduling, emergencies, etc.). All GDR residents, including those on rotation, are required to attend these sessions. Space permitting, continuing education courses offered by the School of Dentistry are available for a minimal fee to postgraduate students.  Approximately 30 courses are offered each year at UAB.\n\n\n    Although not required, opportunities for research are available for the interested resident. Time is limited, but several motivated residents have successfully participated in a variety of research endeavors. The program director can provide additional information.\n\n\n    Goal 1: To prepare residents to provide comprehensive general dentistry services at a level beyond that achieved as a Level 1 GPR/AEGD resident.\n\n\n   Goal 2: To improve the resident’s ability to treat a wide variety of patients with complex medical histories and special needs.\n\n\n    Goal 3: To apply scientific principles to learning and oral health care.\nTo use the principles of critical thinking, evidence of outcomes-based clinical decision making and evidence-based decision information retrieval systems.\n\n\n\n    Goal 4: To utilize the values of professional ethics, lifelong learning, patient centered care, adaptability, and acceptance of cultural diversity in professional practice by acting as mentor for Level 1 residents.\n\n\n    Goal 5: To understand and participate in the oral health needs of communities and engage in community service.\n\n\n    Goal 6: To provide more advance clinical care than Level 1 residents in the following areas:\n\n\n    University Hospital Dental ClinicThe University Hospital Dental Clinic is a 13-chair dental facility located in the UAB Hospital. Each operatory is appropriately equipped. Digital radiography is available throughout the clinic. There are three front-office staff, four dental assistants and one hygienist assigned to the GDR clinic full-time. Inpatient and outpatient needs are readily served by the clinic's convenient location. Convenient parking for patients is available.\n\n\n    University Hospital\nThe University of Alabama Hospital is a major teaching and service facility with a capacity of over 900 beds and educates 900+ medical/dental residents. This well-respected tertiary care hospital serves patients regionally, nationally, and internationally. It is particularly well known for clinical care and research relating to cardiac surgery, cancer therapy, organ transplantation, and rheumatology. The University Hospital is consistently ranked as one of the best health science center hospitals in the United States.\n\n\n    Children's Hospital of Alabama\nChildren's Hospital is a 190-bed tertiary care facility providing care to an extensive population of pediatric patients from the southeast region. A new and expanded Children's Hospital Dental Clinic was recently opened. A full spectrum of services is provided for medically compromised and healthy pediatric patients.\n\n\n    Call\nResidents participate in after-hours call throughout the year. They are on pager call while assigned as the consult resident. They triage patients of record and generally respond via telephone. Residents are required to live within 30 minutes of UAB Hospital in case they are needed for emergency management. The most common emergencies seen in the Emergency Room are stabilization of avulsed and partially avulsed teeth.\n\n\n    Selection of the residents is based on the following criteria:\n\n\n    The GDR Admissions Committee is comprised of two full-time faculty, one part-time faculty and a current GDR resident. Applicants must be a graduate of a fully accredited North American Dental school. Successful completion of the National Boards Part 1 is required. Alabama state licensure is not required for admission. All application forms must be received by September 1 of every year.\n\n\n    As an institution of higher education and in the spirit of its policies of equal employment opportunity, UAB hereby reaffirms its policy of equal educational opportunity. All applicants for admission will be considered without regard to an applicant’s race, color, sex, sexual orientation, age, natural origin, disability unrelated to program performance, disabled veteran status, or Vietnam-era veteran status.\n\n\n    Participation in the PASS application program is mandatory for all applicants. PASS applications should be complete by September 1 of every year. Late applications will not be reviewed. Application materials can be obtained from your dental school or by writing:\n\n\n    PASS\n655 K Street N.W., Suite 800\nWashington, D.C. 20001\nTelephone: (202) 289-7201\nFinancial Information\n\n\n\n    Each resident of the General Dental Residency Program receives stipend support as determined yearly by the administration of the University Hospital. The stipend compares favorably with those of other programs. Specific information is available from the program director. The current stipend is approximately $47,500 a year plus benefits (free parking and cafeteria discount). UAB provides disability insurance and offers a reduced rate for medical insurance utilizing Viva UAB.\n\n\n    For all first-year residents, the residency is to be a full-time endeavor. After hours practice of dentistry will not be permitted. The second-year resident may moonlight on a very limited basis with the written permission of the program director. The second-year resident must be licensed in the State of Alabama.\n\n\n    Individuals accepted for matriculation in the GDR program will be requested to forward a $250.00 deposit. This deposit will be refunded upon entering the program.\n\n\n    All newly-appointed residents must undergo a hospital sponsored pre-employment physical examination. All newly appointed residents will be TB tested at no cost by Employee Health with in the first month of arrival. All newly-appointed residents are also screened for immunization of hepatitis-B and childhood diseases as part of the physical.\n\n\n    The contents of this prospectus represent the most current information available at the time of publication. It is possible that changes may be made with respect to this information without prior notice. Thus, the provisions of this prospectus are not to be regarded as an irrevocable contract between the school and the student.\n\n\n    For information concerning application status, or requests for application materials, or additional information about the University Hospital General Practice Residency and Advanced Education in General Dentistry Programs please contact:\n\n\n    Christine Blass, DMD\nAssistant Professor and Program Director, Hospital Dentistry \nUniversity of Alabama School of Dentistry\nB50 Russell Wing\n1813 6th Avenue South\nBirmingham, AL 35242\nThis email address is being protected from spambots. You need JavaScript enabled to view it.\n\t\t\t\tdocument.getElementById('cloaka8c1f31eb3356ea7029211816cfedeb8').innerHTML = '';\n\t\t\t\tvar prefix = '&#109;a' + 'i&#108;' + '&#116;o';\n\t\t\t\tvar path = 'hr' + 'ef' + '=';\n\t\t\t\tvar addya8c1f31eb3356ea7029211816cfedeb8 = 'cbl&#97;ss' + '&#64;';\n\t\t\t\taddya8c1f31eb3356ea7029211816cfedeb8 = addya8c1f31eb3356ea7029211816cfedeb8 + '&#117;&#97;bmc' + '&#46;' + '&#101;d&#117;';\n\t\t\t\tdocument.getElementById('cloaka8c1f31eb3356ea7029211816cfedeb8').innerHTML += addya8c1f31eb3356ea7029211816cfedeb8;\n\t\t\nOffice: (205) 934-4178", "Program Name": "University of Alabama at Birmingham", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.uab.edu/dentistry/home/academics/postdoctoral/gpr-aegd", "keywords": ["clinical facilities", "gdr resident", "extensive population", "dental clinic", "physical examination", "gdr clinic", "educational opportunity", "dental patient", "more time", "complex patient"]},
{"objectID": "deffa7fc85f6ccf49c82b64cd1b72d00", "title": "Advanced Education in General Dentistry Residency | Department of Dental Medicine  | School of Medicine", "body": "The University Of New Mexico Division Of Dental Services in Albuquerque provides an Advanced Education in General Dentistry residency as part of its mission to increase accessibility to comprehensive dental care for New Mexico’s underserved and medically complex patients. It also strives to serve as an educational model in clinical diagnosis, treatment, research and resources in caring for these populations.\nThe division developed a one-year postdoctoral Advanced Education in General Dentistry (AEGD) residency in July 2004. The program graduated its first residents in June 2005.\nThe residency program has many unique features. Most patient care takes place away from the medical center, at the Camino De Salud Residency Clinic, which has the look and feel of a private dental practice. The residency clinic also houses the Dental Ambulatory Surgery Center, where sedation dentistry is practiced. Residents experience aspects of hospital dentistry through inpatient hospital consultations, coverage of the emergency room and treating dental patients in the operating room.\nThe AEGD Program provides the best possible environment for dental graduates to further their education through providing advanced comprehensive oral health care to medically compromised and special needs populations. And, they gain this experience while living in a beautiful Southwestern setting.\nThe deadline to apply to the new Postgraduate Year 2 Advanced Education in General Dentistry (AEGD) residency is December 30. 2020. The program, which has two open spots, is designed to refine and enhance residents’ clinical skills to improve general dentistry.\nBoth our Postgraduate Year 1 and Year 2 residencies begin July 1, 2021. Students who have completed their first year of postgraduate General Practice Residency or the AEGD program are eligible to apply [PDF].\nThe Advanced Education in General Dentistry Residency Program at The University of New Mexico in Albuquerque is looking for applicants who have integrity and good interpersonal skills – someone who is a team player, assumes responsibility and is reliable.\nWe evaluate applicant essays, externships or extracurricular experiences in general (or specialty) dentistry, letters of evaluation, general extracurricular experiences, public health experience or other work experience, GPR/AEGD/other specialty advanced program completions, publications, presentations and research.\nAll applicants must hold a DDS, DMD or equivalent degree from an accredited U.S. or Canadian dental school prior to admission to the program.\nProspective candidates may download an application from the ADEA PASS Application and Match Registration site. PASS provides a standardized format, relieving applicants of the need to complete multiple applications.\nMaterial must be submitted by January 5, 2021. Late applications will be considered on a case-by-case basis.\nThe AEGD program is open to graduates of American Dental Association accredited DDS or DMD programs in the U.S. or equivalent programs in Canada. Applicants must have passed Part I of the National Dental Board Examination and must pass Part II of the National Dental Board Examination prior to beginning the AEGD residency.\nFor the 2021-2022 application cycle, the UNM School of Medicine AEGD residency program participates in PASS and the Match. The program also does not require applicants to take the Advanced Dental Admission Test (ADAT).\nThe Professional Evaluation Form (PEF) is available in the ADEA PASS application.\nThe Professional Evaluation Form (PEF) is the mandatory letter of recommendation. It does not limit evaluators to a specific topic as special or unique applicant experiences can be highlighted. The AEGD program at UNM requires three (3) letters of professional evaluation. ADEA PASS will process the PEFs per designation.\nThe Institution Evaluation Form (IEF, also called the dean’s letter) is an evaluation of the applicant completed by the dean of the dental school attended. The completed IEF is then sent to every program a candidate applies to. Included in the IEF are NBDE scores or results, a narrative statement and GPA and class rank (if applicable). This evaluation is required for every applicant.\nThe Admissions Committee reviews applications and conducts interviews. We do not mandate a specific minimum grade point average or board score. However, a personal interview at UNM is required prior to admission.\nUNM policies are followed with regard to resident selection. The Division of Dental Services considers all applicants for admission to its AEGD program without regard for ethnicity, creed, religion, handicap, national origin, gender or age.\nResidency training rests on specific objectives and competencies at the Department of Dental Medicine at The University of New Mexico in Albuquerque. These objectives are used to meet the program’s goals. Proficiencies and competencies are tools that measure the resident’s success in meeting the objectives. Proficiency is a higher level of achievement than competency. Consequently, a resident can move from competency to proficiency in the course of the year.\nThese goals are assessed quarterly through multiple evaluations (both of and by the residents) and through an end-of-the-year questionnaire administered to the residents. Periodic surveys of recent graduates will also be used to supplement the data collected. These data are reviewed by the program director and faculty and if needed, appropriate action is taken to improve the resident experience.\nThis program intends for each individual to become competent or even proficient in each of the goals. It's expected that your clinical and didactic experiences will enable you to attain a level of skill and complexity far beyond that achieved in dental school.\nUNM’s Advanced Education In General Dentistry residency program provides a one-year experience in general dentistry in outpatient clinics, the operating room and a hospital setting.\nThe program provides an opportunity and the structure to achieve these competencies, but it's the resident's responsibility to gather the documentation that these skills have been attained. Full- or part-time faculty members will complete most of this documentation on standard forms.\nAt the conclusion of the one-year program, each resident should have fulfilled a set of expected competencies [PDF].\nThe curriculum at the Department of Dental Medicine at The University of New Mexico School of Medicine in Albuquerque includes required didactic and clinical core elements as well as elective assignments. Residents attend seminars as well as local continuing education programs offered by organized dentistry throughout the academic year.\nWe have created a 10-week Special Care Dentistry curriculum, which covers developmental disabilities, geriatrics, sedation and anesthesia, as well as hospital-based dentistry. Lectures, seminars, presentations, hands-on activities and other didactic coursework are part of this curriculum.\nResidents will learn to treat patients with developmental disabilities and qualify to use the New Mexico Department of Health \"Special Needs Code\" for higher reimbursement through clinic rotations, sedation clinic, operating room rotations, seminars and self-study modules. The seminar will cover specific developmental disabilities, management of maladaptive behaviors, use of restraints and positioning devices, use of sedation, treatment planning, prevention and legal issues.\nResidents will study the principles of geriatric dentistry and learn about the demographics and social trends of the aging population, clinical issues and treatment approaches for geriatric patients and pharmacological issues affecting dental therapy, while gaining an understanding of dementia in older people.\nWill review pediatric emergencies, management of oral infections, recognition of abuse, behavior management, pediatric restorative techniques, recognition of dental malocclusion and space maintenance.\nResidents will have clinical and didactic experience using nitrous oxide sedation, oral sedation and parenteral sedation techniques. The clinical experience will also involve treating patients under general anesthesia on an outpatient basis. \nAs part of the sedation curriculum, residents will receive training and certification in both Basic Life support and Advanced Cardiovascular Life Support during the residency year.\nIn addition to treating patients in an operating room setting, residents will learn formal operating room protocols, as well as the required gowning and gloving techniques.\nIdentify the critical steps for commonly used techniques in prosthodontics, understand procedures based on selected dental articles, share experiences and compare the clinical merits of various techniques.\nThe main goal is to allow residents to explore various topics in clinical dentistry in a problem-oriented manner, using Case Presentation, Journal Club, General Practice Presentation and Medical/Dental Interrelationships.\nCritically evaluate the dental and medical literature, perform literature searches, use the computer in literature search, word processing and data management and lead small groups. This is CERP-certified for continuing education credit. Community dentists are invited to attend.\nUse interdepartmental consultations to plan patient treatment, prepare well-organized case reports, speak before groups and understand the behavioral aspects of clinical dentistry.\nThe resident will learn to evaluate, diagnose and treat occlusal problems and how to evaluate the temporomandibular joint. This course combines seminars and clinical evaluation of patients.\nTo recognize and treat endodontic emergencies, diagnose endodontic problems and master filling techniques for single and multirooted teeth. To become familiar with rotary endodontic techniques.\nThe objectives are met through both clinical and didactic interaction. Seminars cover various issues in oral surgery, particularly the physical evaluation of a patient for surgery. This is followed by clinical patient treatment. Dental alveolar surgery skills will be taught, including surgical extractions, removal of impacted teeth and pre-prosthetic surgery. Additional seminars concerning surgical techniques are also provided.\nThis seminar will teach the resident to understand the differential diagnosis for orofacial pain. Neuropathic pain, headache disorders, muscle pain, disorders of the TMJ and oromotor disorders are examined. The pharmacology of pain management is discussed.\nTo teach residents about personal finances, types of insurance coverage a dentist should consider and dealing with debt. The series will also deal with the in and outs of practice acquisition, as well as types of practice arrangements.\nThe objectives are met through both clinical and didactic interaction. Residents will learn how periodontal status affects fixed and removable prosthetic design, understand indications and contraindications for periodontal flaps, learn basic flap design and management, understand the use of different types of bone grafts, understand guided tissue regeneration and understand how resorbable and nonresorbable barriers work. \nIn addition to the formal Patient Care Conferences, faculty meets once a month with residents in a group setting to conduct treatment planning sessions.\nIn addition to invited speakers on professionalism, the program uses the online curriculum developed by the American College of Dentists, residents will examine real-life situations to apply the principles of ethical reasoning, ethical decision-making and professional responsibility as they pertain to the academic environment, research, patient care and practice management.\nThis seminar teaches residents diagnostic and management techniques for various oral pathologies, oral mucosal lesions, and the management of patients undergoing head and neck radiation therapy and/or chemotherapy.", "Program Name": "The University of New Mexico", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://hsc.unm.edu/medicine/departments/dental-medicine/residency/", "keywords": ["specific objectives", "minimum grade", "nitrous oxide", "interpersonal skills", "advanced education", "online curriculum", "personal interview", "first residents", "clinical diagnosis", "oral surgery"]},
{"objectID": "ef18e005b9b2b88d7d5ec3421498cf1e", "title": "Advanced Education in General Dentistry", "body": "Primary Physical Locations\nMain Building\n3302 Gaston Avenue\nDallas, TX 75246\nClinic and Education Building\n3000 Gaston Avenue\nDallas, TX 75226\nMain Number\n214-828-8100\nBack to top", "Program Name": "Texas A&M College of Dentistry", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dentistry.tamu.edu/departments/comprehensive-dentistry/aegd/index.html", "keywords": ["physical locations", "main number", "main building"]},
{"objectID": "bb942221dfa41fc0a52399cbac93fc84", "title": "Advanced Education in General Dentistry - Westwood | UCLA Dentistry", "body": "Length of Program: 1 year\nNumber of Positions: 7 (6 for graduates of CODA accredited dental schools and 1 for graduates of non-CODA accredited dental schools)\nFinancial Arrangement: UC Salary Breakdown\nProgram Director: Dr. Thomas Lee\nThe Westwood AEGD Postgraduate Training Program is a one-year postgraduate certificate program with a major emphasis in clinical restorative and implant (restorative and surgical) dentistry. It is for those highly motivated dental school graduates who wish for additional intensive training in treating various complex and comprehensive cases. The program is designed to prepare each postgraduate to be ready for a private practice environment. A graduate of this program would be expected to have a wide and in-depth level of skills and knowledge to practice advanced general dentistry, and to be comfortable in having interactions with various dental specialties.\nThe didactic portion of the program, which includes various aspects of basic and clinical sciences in dentistry, extends throughout the academic year. Topics covered include all specialty areas of dentistry, physical diagnosis, hospital dentistry, treatment planning, medical emergencies, elements of sedation, oral pathology/medicine, pharmacology, orofacial pain and dysfunctions, implantology, oral radiology, literature review, practice management, etc.\nAll patient care provided by postgraduates is comprehensive. There are many opportunities for the postgraduates to enhance their clinical skills and knowledge in various dental disciplines such as prosthodontics, periodontal and oral surgery, esthetic dentistry, implant dentistry, simple orthodontics, endodontics, and care of the medically-complex patient. Faculty coverage is provided at all clinic sessions. The postgraduates also have access to full dental laboratory support. Each postgraduate's weekly schedule often involves 50+ hours in the clinic and classes. Postgraduates also have after-hour call responsibilities.\nThe majority of the postgraduates' clinical experiences occur in the AEGD clinic located at the Westwood site.\nUCLA AEGD Westwood Residency Objectives\nProvide residents (postdoctoral students) with the necessary didactic and clinical experience that will enable them to provide comprehensive dental care to the broadest possible spectrum of the population.\nProvide residents with training in quality assurance protocols and risk management techniques.\nMotivate residents to be life-long students and to always strive for quality education and self-improvement.\nEnhance the graduate’s ability to make sound evidence-based and patient-centered clinical judgments in arriving at a diagnosis, treatment plan, and decision-making assessments during the course of treatment or post-treatment outcomes.\nEstablish the general dentist’s function within the interdisciplinary health care team.\nEnhance the understanding of and provide experience in practice administration.\nProvide residents with an educational experience in understanding the oral health needs of communities by engaging in community service.\nUpon completion of the training program, the graduate will be competent to:\nServe as the patient’s first contact with the dental health care system and to facilitate the patient’s entry into that system with minimal specialty referral.\nPossess the knowledge and skills to appropriately apply risk assessment techniques and participate in a peer guided quality assurance program.\nProvide care in all aspects of general dentistry, including operative dentistry, fixed and removable prosthodontics, esthetic dentistry, implant surgery and restoration, periodontics, preventive dentistry, endodontics, oral surgery, anesthesia and pain control, and management of the medically compromised and geriatric patient.\nManage a dental practice effectively.\nPossess the knowledge and skills to develop appropriate treatment plans that meet the comprehensive needs of patients.\nAppropriately coordinate with auxiliary personnel, including dental assistants, dental hygienists, receptionists, and dental laboratory technicians.\nUtilize clinical judgment to assess one’s own abilities and limits.\nParticipate in interdisciplinary medical and dental treatment teams.\nRetrieve, review and assess scientific literature.\nHave a working understanding of general dentistry’s role in health care systems.  \nApplication Due: October 16\nInterviews: Mid-December\nAcceptance Notifications: End of January\nPASS Application: Yes\nThe admissions committee considers the following criteria in its decisions:\nAcademic achievements\nResearch Experience\nDemonstrated interest in/commitment to general dentistry\nLife experience\nContent of recommendation letters (3 PPIs and 2 PEFs)\nApplicants will be notified of acceptance through the Match service. To find out when results will be available, please consult the Match service. A letter of acceptance signed by the Program Director and Associate Dean of Academic Affairs will be issued upon acceptance.\nThe program in Advanced Education in General Dentistry - Westwood is accredited by the Commission on Dental Accreditation of the American Dental Association and has been granted the accreditation status of \"Approval without Reporting Requirements”. The Commission is a specialized accrediting body recognized by the United States Department of Education. The Commission on Dental Accreditation can be contacted at (312) 440-4653, by visiting www.ada.org/coda, or by mail at 211 East Chicago Avenue, Chicago, IL 60611-2678.\nNotice to Trainees re: Professional Licensure and Certification\nUniversity of California programs for professions that require licensure or certification are intended to prepare the student for California licensure and certification requirements. Admission into programs for professions that require licensure and certification does not guarantee that students will obtain a license or certificate. Licensure and certification requirements are set by agencies that are not controlled by or affiliated with the University of California and licensure and certification requirements can change at any time.\nThe University of California has not determined whether its programs meet other states’ educational or professional requirements for licensure and certification. Students planning to pursue licensure or certification in other states are responsible for determining whether, if they complete a University of California program, they will meet their state’s requirements for licensure or certification. This disclosure is made pursuant to 34 CFR §668.43(a)(5)(v)(C).", "Program Name": "University of California, Los Angeles", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dentistry.ucla.edu/academics-admissions/postgraduate-and-residency-training-programs/advanced-education-general-dentistry", "keywords": ["scientific literature", "dental practice", "orofacial pain", "possible spectrum", "clinical judgment", "dental specialties", "private practice", "general dentist", "intensive training", "dental disciplines"]},
{"objectID": "7983da62dd2823aa61928d3922412426", "title": "Advanced General Dentistry - University of Mississippi Medical Center", "body": "", "Program Name": "The University of Mississippi Medical Center", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.umc.edu/sod/Departments/Advanced-General-Dentistry/Advanced-General-Dentistry.html", "keywords": []},
{"objectID": "8edeed9b3400d2523b597b7d9d91b59b", "title": "Advanced Education In General Dentistry (AEGD) Residency Program | VA Birmingham Health Care | Veterans Affairs", "body": "The Birmingham VA Medical Center is a progressive and innovative teaching facility and enjoys a close affiliation with the University of Alabama at Birmingham (UAB)School of Dentistry.  This collaboration helps to provide this medical center with excellent resources and an academic environment that provides for an outstanding residency program in general dentistry.\nThe AEGD Residency Program is a comprehensive General Dentistry Program with advanced training in most aspects of dentistry. The program is designed to provide training beyond the level of pre-doctoral education in oral health care, using applied basic and behavioral sciences. Education is based on the concept that oral health is an integral and interactive part of total health. Our program is designed to expand the depth and scope of the graduates knowledge and skills to enable them to provide comprehensive oral health care to a diverse range of population groups, with an emphasis on the medically compromised. Our philosophy of resident education, was best articulated by the well respected dental educator, the late Dr. Morton Amsterdam, who was quoted as saying: “We all have eyes with which to see, but  we see only that, which we know.”\nThe residents rotate through a series of clinical disciplines that include endodontics, operative, oral diagnosis, periodontics, prosthodontics, and oral surgery(3 months).One of the strengths of our program is the training received in the surgical placement of dental implants, advanced bone grafting techniques including site preservations and indirect sinus lifts, and periodontal surgical  procedures. There is also an opportunity to become IV sedation certified with the didactic and clinical training provided through the oral surgery rotation.  Each resident is required to complete two comprehensive care cases that have been completely documented with radiographs, mounted study models, and clinical photographs. These cases will be presented to the clinical faculty in June, prior to the completion of the program. \nThe program provides the residents with the opportunity to interact with physicians, nurses, pharmacists, and other health care professionals as part of a multi-disciplinary health care team.  The goal of providing each resident with the opportunity for professional growth and advancement, is enhanced by  monthly participation in Literature  Review , a monthly Clinical Seminar Series on current procedures and techniques, and the continuing educational opportunities offered at UAB School Of Dentistry. \nLast updated: February 8, 2022", "Program Name": "V.A. Medical Center, Birmingham", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.va.gov/birmingham-health-care/programs/advanced-education-in-general-dentistry-aegd-residency-program/", "keywords": ["dental implants", "surgical placement", "excellent resources", "resident education", "professional growth", "advanced bone", "diverse range", "comprehensive care", "other health", "close affiliation"]},
{"objectID": "ef18e005b9b2b88d7d5ec3421498cf1e", "title": "Advanced Education in General Dentistry", "body": "", "Program Name": "Dental College of Georgia at Augusta University", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.augusta.edu/dentalmedicine/academics/adved/aegd.php", "keywords": []},
{"objectID": "ea70f29f7dddb02f7d1aafa2493aaff7", "title": "AEGD Program - VCU Department of General Practice", "body": "The 12- or 24-month Advanced Education in General Dentistry residency program provides advanced education and clinical experience to prepare dental school graduates for a career in the practice of comprehensive general dentistry. Graduates of the AEGD program will have attained added competency and confidence in all areas of dental care, practice management and professional responsibility. \nThe AEGD program is accredited by the Commission on Dental Accreditation. The Commission is a specialized accrediting body recognized by the United States Department of Education. The Commission on Dental Accreditation can be contacted at (312) 440-4653 or at 211 East Chicago Avenue, Chicago, IL 60611.\nUpon completion of this program, the AEGD resident should be able to:\nThe VCU School of Dentistry facilities are housed in the Perkinson, Dental Building 1 and Lyons buildings and contain clinical facilities, research facilities, classrooms, student laboratories, departmental offices and a computer learning laboratory. The laboratories and classrooms contain closed-circuit television receivers. The Health Sciences Library, the largest health science library in Virginia, is located across the street from the School of Dentistry.\nProgram information such as infection and biohazard policies, dental radiation policies and HIPAA privacy policies can be obtained by contacting the AEGD department. \nThis program participates in the American Dental Education Association Postdoctoral Application Support Service program. The program deadline for application through PASS is September 1.  Applicants are not required to take the Advanced Dental Admissions Test to apply.\nDental graduates from U.S. institutions accredited by their respective Commissions on Dental Accreditation who have passed Part 1 of the National Dental Board Examination are eligible to apply for the AEGD program. Successful completion of Part II and eligibility for licensure in Virginia are required prior to admittance to the program. \n* If graduates are instead challenging the Integrated National Dental Board Exam, part 1 is not required and successful completion of the INDBE is required prior to admittance. \nDental applicants trained outside the United States must be a graduate from an international dental school resulting in a degree/diploma in dentistry recognized by the appropriate civilian authorities of the country which the school is located. Information on how international trained dentists can apply is found here.\nSelection criteria for all applicants include didactic and clinical achievements, extra-mural achievements, interpersonal skills and a demonstrated commitment to pursue a career in general dentistry.\nInterviews are by invitation only. Please note that not all applicants will be interviewed. Interviews are traditionally held in October. As a reminder, the deadline for all applications in PASS is September 1.\nIf an applicant has not received an invitation to interview by October, it can be assumed by the applicant that they will not be selected for that admission cycle.\nCandidates selected for admission will be notified by Nov. 15. All applicants will receive notification of action taken by the admissions committee from the program director by Nov. 15.\nApplicants meeting the requirements for admission, but not granted an interview, are encouraged to apply again the following year. Reapplication must be completed through PASS.\nResidency stipends are subject to change annually.\nThe commonwealth of Virginia self-insurance program provides professional liability (malpractice) coverage, subject to policy limits, for advanced dental education students. Coverage includes professional service on duty within the institution and professional service on assigned duties in one of the affiliated hospitals or programs. It does not cover any other professional service, e.g. moonlighting activities at other facilities or institutions.\nThere are no AEGD tuition and fees. Information on AEGD stipends is found here.\n\n            Virginia Commonwealth University\n            School of Dentistry\n            Department of General Practice\n            Lyons Dental Building\n            520 North 12th Street\n            Richmond, Virginia 23298-0566\n            Contact us", "Program Name": "Virginia Commonwealth University", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://generaldentistry.vcu.edu/advanced/", "keywords": ["aegd program", "clinical facilities", "other facilities", "interpersonal skills", "departmental offices", "dental building", "advanced education", "dental care", "civilian authorities", "largest health"]},
{"objectID": "e4ee124f6825ba1f38c3125e19a3d87e", "title": "The Advanced Education In General Dentistry-1 (AEGD-1) | VA Fayetteville Coastal Health Care | Veterans Affairs", "body": "Dental is located on the ground floor of the main hospital building with 13 dental treatment rooms and an on-site dental laboratory. The faculty consists of one service chief, one assistant chief, six full time dentists and two rotating part-time consultants. The remainder of the staff consists of three dental hygienists, 14 dental assistants, one lead assistant, four dental laboratory technicians, and one program assistant. The dental clinic uses current state of the art equipment: endo microscopes, digital radiography and cone beam computed tomography.\nProgram Description:\nThe Advanced Education in General Dentistry-1 (AEGD-1) Program at the Fayetteville, North Carolina Veteran Affairs Medical Center (VAMC) is a one-year residency that accepts five residents per year. Our goal is to provide the general dentist with continued opportunity for professional growth and advancement. This comprehensive program prepares the resident to meet the oral health needs of a wide variety of medically compromised ambulatory and hospitalized patients. It also advances the residents’ knowledge and skill in clinical dentistry by exposing them to a significant number of supervised, comprehensive treatment experiences. The program provides residents with the opportunity to interact with physicians, nurses, pharmacists, social workers and other health care professionals as part of a multi-disciplinary health care team.\nThe program curriculum is conducted at the postgraduate level (PGY-1) and consists of didactic and clinical instruction in nearly all areas of dental treatment modalities under the guidance of experienced professionals.\nEmphasis is made in the treatment planning and comprehensive treatment of medically compromised patients through direct faculty supervision and case presentations where all aspects of patient management are discussed.\nResidents have the opportunity to place and restore dental implants. The didactic phase of the program consists of literature reviews, conferences, lectures and demonstrations at the VA Medical Center as well as interaction with our Department of Defense partners at Fort Bragg. Operating room cases and rotations to other services are some of the activities that complement the clinical curriculum. Rotations in Primary Care, Anesthesiology and the Urgent Care are designed to facilitate the residents’ experiences with medically compromised patients, hospital and surgical protocols, physical evaluation and medical assessment and increase their knowledge of systemic diseases and the medications used to treat our patients. As part of the program’s community service, residents and staff provide oral surgery services at a local dental clinic that provides care to low income individuals.\nCODA Commission on Dental Accreditation\nThe program in Advanced Education in General Dentistry is accredited by the Commission on Dental Accreditation [and has been granted the accreditation status of Approval Without Reporting Requirements.]  The Commission is a specialized accrediting body recognized by the United States Department of Education. The Commission on Dental Accreditation can be contacted:\nThe Commission on Dental Accreditation\n211 East Chicago Avenue\nChicago, IL 60611\n312-440-4653 \nThe Commission’s web address is: Commission on Dental Accreditation (CODA) (ada.org) *. \n*This link takes you outside of the Department of Veterans Affairs Website. VA does not endorse and is not responsible for the content of non-VA linked websites. The link will open in a new window.\nThe Commission on Dental Accreditation has accredited the postdoctoral program in Advanced Education in General Dentistry. However, this education area is not one of the American Dental Association’s recognized dental specialty areas. Therefore, dentists graduating from this program cannot announce that they are specialists, as recognized by the American Dental Association.Opportunity to File Complaints\nThe Commission on Dental Accreditation will review complaints that relate to a program’s compliance with the accreditation standards. The Commission is interested in the sustained quality and continued improvement of dental education programs but does not intervene on behalf of individuals or act as a court of appeal for treatment received by patients or individuals in matters of admission, appointment, promotion, or dismissal of faculty, staff or students.\nThe Commission will consider only written, signed complaints; oral and unsigned complaints will not be considered. The Commission on Dental Accreditation can be contacted at: \nThe Commission on Dental Accreditation\n211 East Chicago Avenue\nChicago, IL 60611\n312-440-4653 \n1. Act as primary care provider for individuals and groups of patients. This includes providing emergency and multidisciplinary comprehensive oral health care, providing patient focused care that is coordinated by the general practitioner; and directing health promotion and disease prevention activities.\n2. Plan and provide multidisciplinary oral health care for a wide variety of patients including patients with special needs.\n3. Manage the delivery of oral health care by applying concepts of patient and practice management and quality improvement that are responsive to a dynamic health care environment.\n4. Function effectively and efficiently in multiple health care environments within interdisciplinary health care teams.\n5. Apply scientific principles to learning and oral health care. This includes using critical thinking, evidence or outcomes-based clinical decision-making and technology-based information retrieval systems.\n6. Utilize the values of professional ethics, lifelong learning, patient centered care, adaptability, and acceptance of cultural diversity in professional practice.\n7. Understand the oral health needs of communities and engage in community service.\n*Based on ADA guidelines \nThe AEGD Residents are expected to make a full-time commitment to the program during their academic year. This translates to on-time attendance at all scheduled lectures and conferences while devoting time beyond regular clinic hours to program related activities. Residents are encouraged to participate actively in all case presentations and treatment planning discussions and critically analyze and discuss scientific articles during the literature review meetings.\nResidents are expected to diagnose and treat veteran patients in a diligent and compassionate manner and to relate well and respectfully to fellow workers and the general public. Appropriate dress and appearance is required for all activities associated with the program. Scrub-wear is provided.\nDental Residents are evaluated daily on their knowledge through interactions with mentors in the clinical setting, literature reviews, treatment planning conferences and during case discussions. Their treatment skills are also evaluated daily through clinical observations, review of lab cases, daily and monthly record reviews and other contact with mentors.   Resident’s skills are assessed and critiqued whenever they are observed and residents are informed of ways to improve clinical skills, dental record entries and/or patient management techniques. Informal counseling is used to identify both strengths and weaknesses and includes advice on how to provide better dental care for their patients. Formally, residents are evaluated quarterly in writing by the mentors and director using the Dental Resident Rating Report.\nA. Operative Dentistry:\n1. Restore single teeth in the permanent dentition with a wide range of materials and methods.\n2. Place restorations and perform procedures to enhance the patient’s facial esthetics.\n3. Restore endodontically treated teeth.\nB. Restoration of Edentulous Space\n1. Replace missing teeth for patients utilizing removable prostheses.\n2. Replace missing teeth for patients utilizing uncomplicated (6 units or less) fixed prosthesis.\n3. Communicate prosthesis design to laboratory technicians in a professional and effective manner and evaluate the resultant prosthesis.\n4. Integrate implant dentistry with conventional dental therapy\n5. Diagnose, plan, and place conventional implants\n6. Restore uncomplicated endosseous conventional implants with fixed or removable prostheses\nC. Periodontal therapy:\n1. Diagnose and treat early and moderate periodontal disease using surgical and non-surgical procedures.\n2. Diagnose and manage advanced periodontal disease.\n3. Evaluate the results of periodontal treatment then establish and monitor a periodontal maintenance program.\nD. Endodontic therapy:\n1. Diagnose and treat pain of pulpal origin.\n2. Perform uncomplicated non-surgical anterior and posterior endodontic therapy.\n3. Manage uncomplicated non-surgical molar endodontic therapy.\n4. Treat or manage endodontic complications\nE. Oral surgery:\n1. Perform surgical and non-surgical extraction of teeth.\n2. Perform uncomplicated hard and soft tissue pre-prosthetic surgery.\n3. Treat or manage patients with complications related to intra-oral surgical procedures\nF. Evaluation and treatment of dental emergencies:\n1. Diagnose and treat patients with intra-oral dental emergencies and infections.\n2. Diagnose and manage intra-oral hard and soft tissue lesions of traumatic origin.\nG. Pain and anxiety control utilizing behavioral and pharmacologic techniques: \n1. Provide control of pain and anxiety in the conscious patient through the use of psychological interventions, behavior management techniques, local anesthesia and oral conscious sedation techniques.\n2. Prevent, recognize and manage complications related to the use and interactions of drugs, local anesthesia and oral conscious sedation\nH. Medical Emergencies: \n1. Anticipate, diagnose and provide initial treatment and follow-up management for medical emergencies that may occur during dental treatment.\nI. Oral Mucosal Diseases and oral and maxillofacial pathology \n1. Diagnose and manage common oral mucosal lesions by accurately describing and developing a reasonable differential diagnosis and treatment plan.\n2. Demonstrate use and knowledge of appropriate medications to treat oral-facial diseases\n3. Perform biopsy of oral tissue and correctly complete tissue submission form for microscopic evaluation\n4. Recognize and diagnose common oral maxillofacial pathology\nJ. Temporomandibular disorders and orofacial pain: \n1. Demonstrate the ability to diagnose simple facial pain/TMD and manage with either pharmacologic agents or splints or combination of both.\n2. Diagnose, treat or refer patients with orofacial pain\nK. Occlusal disorders: \n1. Diagnose and manage patients with occlusal problems such as worn dentition, poor anterior guidance, traumatic occlusion, centric relation prematurity, or occlusal plane discrepancy\nL. Assess, diagnose, plan and provide emergency and comprehensive multidisciplinary oral healthcare for a wide variety of patients including those with special needs:\n1. Obtain and interpret the patient’s chief complaint; medical, dental and social history; and review of systems. 2. Function as the patient’s primary and comprehensive oral health care provider.\n3. Use available diagnostic and prognostic information to integrate multiple disciplines into an individualized, comprehensive and sequenced treatment plan for patients with complex needs.\n4. Develop and carry out dental treatment plans for patients with special needs such as complex medical problems, significant physical limitations and developmental disabilities\n5. Modify the treatment plan, as indicated, to effectively manage unexpected circumstances or individual patient needs.\nM. Obtain informed consent:\n1. Obtain informed consent for dental treatment by discussing with patients or guardians of patients the following: findings; diagnoses; risks, benefits, alternatives, and process of various treatment options, realistic treatment expectations, and patient responsibilities during and after treatment.\nN. Function effectively within interdisciplinary health care teams including consultation and referral:\n1. Obtain and interpret clinical and radiographic data and additional diagnostic information from other health care providers or other diagnostic resources.\n2. Make referrals to, and obtain consultations from, professional colleagues for the assessment of medical, psychological, and social problems presented by dental patients\nO. Provide and manage delivery of patient-focused care that is coordinated by the general practitioner:\n1. Develop and carry out dental treatment plans for patients, including patients with special needs in a manner that considers and integrates the patient’s medical, psychological and social needs.\n2. Consult with dental specialists and coordinate patients’ care with dental specialists determined by the patient’s treatment plan.\nP. Direct health promotion and disease prevention activities:\n1. Participate in community programs to assist in the prevention and reduction of oral disease.\n2. Use accepted prevention strategies such as oral hygiene instruction, nutritional education and pharmacologic intervention to assist patients in the improvement and maintenance of their oral and systemic health.\nQ. Use advanced dental treatment modalities as defined by the program:\n1. Incorporate conventional implants in the patient’s treatment plan\n2. Use implant retained removable prosthesis whenever indicated to restore edentulous and partially edentulous patients\n3. Perform surgical extractions whenever the clinical situation requires\n4. Use CBCT to diagnose osseous lesions and plan implant placement\nR. Physical evaluation and medical assessment:\n1. Obtain and interpret the patient’s chief complaint, medical, dental and social history and review of systems\n2. Know the indications for common lab studies and how to interpret their results\n3. Understand the relationship between oral health and systemic disease\n4. Interpret a physical evaluation performed by a physician to determine its impact on dental treatment\nS. Practice Management:\n1. Provide patient care by working effectively with allied dental personnel and performing sit-down four-handed dentistry.\n2. Employ and promote ethical principles in the practice of dentistry and in relationships with patients, personnel and colleagues.\n3. Understand, and participate in, a system for continuous self-evaluation and quality improvement in a dental practice.\n4. Understand basic principle of business management and practice development\nSalary is approximately $50,000 per year.  The residents are entitled to 13 days annual leave and six days of sick leave accrued during the academic year.  Residents are also eligible for life insurance and health insurance at a greatly reduced rate. \nThe residents work four 10-hour days (7 am to 5:30 pm) per week and will be on a day off schedule of Monday one week and Tuesday the next or a Thursday Friday schedule.  Residents are expected to take call every fifth week. The program observes all federal holidays (9 per academic year).\nThe deadline for submission of the application and all related materials is October 2, 2020. Ten selected candidates will be notified and interviewed on October 21, 2020. Letters of final notification for the class of 5 selected will be sent in early November. This program does not participate in the PASS program or require the ADAT.\nThe application requirements are:\nRarely do residents do dental cleanings; we have hygienists that do routine prophylaxis.  Residents may perform root plane/scaling on patients with periodontal disease.\nYes, each resident has an assigned assistant, dental operatory and an established pool of patients\nYes, the residency staff encourages our residents to work in local practices to help them understand what is expected of a dentist in private practice.\nYes, we have three different implant systems (one tissue level and two bone level) that residents use.  Historically the average resident will place between 25 and 30 implants during our program.  The majority of the implants are for single tooth replacement; residents also place and restore implants to support partials and dentures.\nWe have a lab with four lab techs who perform mainly removable procedures and pour impressions, and repair removable prostheses.  We are supported by a central dental lab that does all fixed prosthesis, flexible partials and metal partial frameworks. The residents are expected to trim dies, make surgical stents, do diagnostic waxings for treatment planning cases, and survey and design casts for partial dentures.\nNo, residents rotate through anesthesia and are exposed to sedation, general anesthesia and airway management.\nWe are looking for dentists that have good clinical skills and can work well as part of a team. Historically, individuals selected have been in the top half of his/her dental class.\nFor additional information or to schedule a visit, contact the Program Director via e-mail: Bryan.Roach@va.gov.  Or mail or call:\nBryan Roach, D.D.S.\nDirector, AEGD-1 Residency Program\nFayetteville VAMC Dental Service (160)\n2300 Ramsey St.\nFayetteville, NC 28301\nPhone:  (910) 822 7030\nFax:  (910) 482 5050\nLast updated: October 20, 2021", "Program Name": "V.A. Medical Center, Fayetteville", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.va.gov/fayetteville-coastal-health-care/work-with-us/internships-and-fellowships/the-advanced-education-in-general-dentistry-1-aegd-1/", "keywords": ["dental implants", "dental clinic", "dental cleanings", "removable procedures", "periodontal disease", "pharmacologic intervention", "local practices", "advanced education", "sustained quality", "critical thinking"]},
{"objectID": "87284f873727f03e9f4e64b8578e41db", "title": "Advanced Education in General Dentistry | School of Dental Medicine", "body": "The Tufts University Advanced Education in General Dentistry Program (AEGD) was founded in 2014. It is conducted with the cooperation and participation of its sponsoring institutions, Tufts University School of Dental Medicine (TUSDM) and Maine Medical Center (MMC) and its major affiliated institution, Community Dental (CD) and Tufts Dental Facilities (TDF). There are eight positions available in this one-year program; four positions are situated in Boston and four are situated in Maine.\nThe Boston-based residents receive clinical instruction primarily at Tufts University School of Dental Medicine. Training emphasizes general dentistry including diagnosis and treatment planning, preventive dentistry, restorative dentistry, oral surgery, periodontal treatment, and endodontics for the general population. Residents also receive instruction through Tufts Dental Facilities in treating patients with multiple disabilities and limitations.\nThe rotations provide the residents with diverse clinical and educational experiences. The Maine-based residents receive clinical instruction at Community Dental clinics in Portland, Biddeford, and Lewiston, and include rotations in Farmington and Rumford. Training emphasizes general dentistry including diagnosis and treatment planning, preventive dentistry, restorative dentistry, oral surgery, periodontal treatment, and endodontics for the general population. Additionally, residents treat patients with multiple disabilities and limitations as well as focused care for vulnerable populations, and pediatric patients at Community Dental clinics.\nThe didactic portion of the AEGD program is conducted throughout the year. The program includes continuing education courses given at the University, at Community Dental and at other institutions. Residents participate in weekly patient care conferences (including guest lectures) both in-person and through a distance-learning website created for the program. Emphasis is placed on ideal, alternative, and actual treatment planning via case presentations for both dental and medical management for all patient populations.\nThe goals and objectives of the Tufts AEGD will prepare graduates to become an important part of the communities they choose to serve. Emphasized goals prepare practitioners to\nEach trimester, faculty members review individual personal and professional goals specifically designed by each resident. Each resident is able to focus on his/her own needs and interests in dentistry and medicine and to further enhance the variety of definitions he/she may consider necessary to be successful in post-graduate training.", "Program Name": "Tufts University - Maine", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dental.tufts.edu/academics/postgraduate-programs/advanced-education-general-dentistry", "keywords": ["aegd program", "general population", "weekly patient", "periodontal treatment", "own needs", "advanced education", "general dentistry", "sponsoring institutions", "affiliated institution", "restorative dentistry"]},
{"objectID": "1da0f89fb473271e7aa0c4a896bb2bda", "title": "Massachusetts - Edward M. Kennedy Community Health Center - AEGD", "body": "Subscribe to receive information about NYU Langone Dental Medicine Postdoctoral Residency Programs.\n\nAEGD Positions Available for 2022\nFor more information, visit AEGD Positions Available for 2022.\nHelping people live healthier lives. The Edward M. Kennedy Community Health Center is a private, non-profit community health center serving over 100 communities. They provide comprehensive medical, dental, and specialty care; health education and nutritional counseling; optometry and ophthalmology services; on-site and discount pharmacy services; and assistance in navigating the health care system. Founded in 1972, the Kennedy CHC has grown from a small practice housed in Worcester public housing to a multi-site, full service provider of primary care, medical specialties, dental, behavioral health and social services throughout the Central and MetroWest areas of Massachusetts. A federally qualified community health center, The Edward M. Kennedy CHC is a state certified minority enterprise, accredited by the Joint Commission and has been certified as a NCQA Patient Centered Medical Home (PCMH). Dental services are provided for pediatric and adult patients. The resident can expect to perform general and specialty procedures under the guidance of highly qualified faculty including dental exams, development of treatment plans, cleanings, x-rays, oral health education, urgent dental care, fluoride treatments, decay, root canals, extractions, crowns, bridges, mouth guards and partial and full dentures.\n19 Tacoma StreetWorcester, Massachusetts 01608\nDr. Brian GennaDental Directorbrian.genna@kennedychc.org Brian.Genna@nyulangone.org\nEdward M. Kennedy Community Health Center - Tacoma Street19 Tacoma Street Worcester, Massachusetts 01608\n\n© 2021 NYU Langone Health. All Rights Reserved. The contents of this communication are for informational purposes only and do not constitute an endorsement or promotion of the external entity or any of its products or services.\nSitemap       Terms &amp; Conditions       Privacy Guidelines", "Program Name": "NYU Langone Dental Medicine - Edward M. Kennedy FHC - Worcester, MA", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.nyulangonedental.org/programs/ma/edward-m-kennedy-community-health-center/aegd", "keywords": ["primary care", "behavioral health", "informational purposes", "healthier lives", "dental exams", "fluoride treatments", "dental care", "external entity", "medical home", "social services"]},
{"objectID": "8ac5074be067f65b97b1657a6aea5063", "title": "Advanced Education in General Dentistry Home Page", "body": "", "Program Name": "Wichita State University", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.wichita.edu/aegd", "keywords": []},
{"objectID": "41feeddbe845afc4f851bcf4594d6341", "title": "Arizona - Pascua Yaqui Tribal Dental Center - AEGD", "body": "Subscribe to receive information about NYU Langone Dental Medicine Postdoctoral Residency Programs.\nLearning and practicing in close-knit community with high quality faculty mentors. Pascua Yaqui Tribal Dental Center is affiliated with El-Rio Community Health Center. Our Pascua Yaqui clinic is housed at the Hiak Hitevi Kari (Yaqui Healer's House) at the tribal head quarters located at 7490 South Camino de Oeste. The tribal center's goal is to provide comprehensive Dentistry in a comfortable and culturally correct environment to all community members. Dental residents can expect to treat all age groups within the community while handling unique and complex conditions affilitiated with this ethnically diverse and culturally rich population. Interaction with and guidance from onsite faculty and faculty from El Rio facilities will provide residents with unparalleled mentoring from high-quality practitioners while experiencing a close relationship with community members.\n7490 South Camino de OesteTucson, Arizona 85757\nDr. Ronald ToepkeDental Directorron.toepke@pascuayaqui-nsn.gov\nPascua Yaqui Tribal Dental Center - Tucson7490 South Camino de Oeste Tucson, Arizona 85757\n© 2021 NYU Langone Health. All Rights Reserved. The contents of this communication are for informational purposes only and do not constitute an endorsement or promotion of the external entity or any of its products or services.\nSitemap       Terms &amp; Conditions       Privacy Guidelines", "Program Name": "NYU Langone Dental Medicine - Southern Arizona, Pascua Yaqui Tribal Health Center", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.nyulangonedental.org/programs/az/pascua-yaqui-tribal-dental-center/aegd", "keywords": ["close relationship", "high quality", "informational purposes", "tribal center", "unparalleled mentoring", "comprehensive dentistry", "dental residents", "tribal head", "dental medicine", "onsite faculty"]},
{"objectID": "02fa526f78662588fc09d9eac74cdf3a", "title": "Advanced Education In General Dentistry Residency Program | VA Martinsburg Health Care | Veterans Affairs", "body": "The Martinsburg VAMC offers a one year dental Advanced Education in General Dentistry Residency Program which specifically revolves around the requirements listed by the ADA Commission on Dental Accreditation. The program begins July 1 of each year and ends 52 weeks later. Salary is $54,278 for the academic year, health benefits as well as life insurance are available, and malpractice liability coverage is provided for you.\nEndodontics                                    Fixed Prosthodontics/Implants\nOperative Dentistry                      Oral Diagnosis / Treatment Planning\nOral Pathology                                Oral and Maxillofacial Surgery\nPeriodontics                                     Pain Management and Ethics\nRemovable Prosthodontics       Special Emphasis Groups (e.g., homeless, women, post-deployment, etc.)\nResidents spend approximately 80 percent of their time in the clinical care of dental patients. There is also a didactic portion of the program which consists of treatment planning seminars, conferences and web-based trainings, literature reviews as well as lectures in physical diagnosis, prosthodontics, endodontics, practice management and other special topics. Though all dentists including residents are considered available and responsible for the care and welfare of their patients seven days a week, the typical tour for the Resident is weekdays, 8 a.m. to 4:30 p.m.\nThe AEGD program here at the Martinsburg VAMC participates in the Postdoctoral Application Support Service Program (PASS). To apply visit ADEA PASS website at www.adea.org/pass/. Deadline for application submission is October 1. Personal interviews are required and will be scheduled for selected candidates during the November/December months prior to start of the next term. Currently, our program supports two residents for a one year term.\nThe Martinsburg VAMC is committed to a program of equal opportunity. Selection of residents is made without regard to race, color, national origin, sex, age, or sexual orientation. Candidates must be graduates of an accredited United States or Canadian dental school. Although a permanent license is not required, the candidates must meet licensure requirements.\nPhone: 304-263-0811  Ext. 3316\nMail: Martinsburg VA Medical Center\nDental Residency\nDental Service (160)\n510 Butler Ave.\nMartinsburg, WV 25405\n\n            Peter McCutcheon  D.D.S.\n        \n\n          Staff Dentist/Residency Director - Dental Service\n\n          VA Martinsburg health care\n        \n\n          Phone: 304-263-0811 Ext. 3316/3339\n        \n\n          Email: peter.mccutcheon@va.gov\n        \nLast updated: November 3, 2021", "Program Name": "V.A. Medical Center, Martinsburg, WV", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.va.gov/martinsburg-health-care/work-with-us/internships-and-fellowships/advanced-education-in-general-dentistry-residency-program/", "keywords": ["dental service", "sexual orientation", "advanced education", "typical tour", "academic year", "physical diagnosis", "medical center", "permanent license", "next term", "personal interviews"]},
{"objectID": "a811361568691817fdbe768cdf644666", "title": "AEGD | University of Detroit Mercy", "body": "", "Program Name": "University of Detroit Mercy", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dental.udmercy.edu/programs/graduate/aegd/index", "keywords": []},
{"objectID": "9fad312e1e6f7ac997afe0e323d304a8", "title": "Georgia - Good Samaritan Health Center - AEGD", "body": "Subscribe to receive information about NYU Langone Dental Medicine Postdoctoral Residency Programs.\nGood Samaritan Health Center’s dental department offers an accredited one-year Advanced Education in General Dentistry Program (AEGD) with the option of a second year focused on Public Health.  The Department’s goal is to provide excellent well rounded advanced training in general dentistry procedures for individuals looking to have a career in general dentistry serving in a Public Health metropolitan location or small rural community setting.\nGood Samaritan is a non-profit community health center located in the West End community of Atlanta about one mile from Mercedes Benz Stadium.  The center offers a full compliment of primary medical, dental and behavioral health services with the goal of providing the full circle of health for our patients.  The clinic’s stated mission is “Sharing Christ’s love through quality health care with those in need” and the patient population is the working poor of Atlanta.  We have a 15 chair dental clinic equipped for modern 4-handed dentistry including digital x-rays and CBCT.\nThe program provides clinical and didactic training for comprehensive care and our medical department provides support for handling patients with more complex medical issues.  We also have boarded specialty support for oral surgery and periodontics.  Our department director has extensive training in endodontics, periodontics and prosthodontics.  Good Samaritan is partnered with another local NYU-Langone AEGD program to provide ongoing lecture, seminars, hands on continuing education and other presentations that cover a wide range of advanced dental topics.\nAdditional information is available at our website: http://goodsamatlanta.org.  We look forward to receiving your application.\n1015 Donald Lee Hollowell Pkwy. NWAtlanta, Georgia 30318\nDr. John SiewekeJohn.Sieweke@nyulangone.org\nGood Samaritan Health Center - Atlanta1015 Donald Lee Hollowell Pkwy. NWAtlanta, Georgia 30318\n© 2021 NYU Langone Health. All Rights Reserved. The contents of this communication are for informational purposes only and do not constitute an endorsement or promotion of the external entity or any of its products or services.\nSitemap       Terms &amp; Conditions       Privacy Guidelines", "Program Name": "NYU Langone Dental Medicine - Good Samaritan Atlanta, GA", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.nyulangonedental.org/programs/ga/good-samaritan-health-center/aegd", "keywords": ["aegd program", "informational purposes", "dental clinic", "dental topics", "medical department", "advanced education", "comprehensive care", "external entity", "general dentistry", "second year"]},
{"objectID": "7e2cbbc7bf1994cf0d45e424772348c4", "title": "Advanced Education in General Dentistry | Postgraduate Dental Education | Educational\n         Programs | College of Dentistry | UTHSC", "body": "", "Program Name": "University of Tennessee Health Science Center, College of Dentistry, Nashville", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://uthsc.edu/dentistry/educational-programs/postgrad/aegd.php", "keywords": []},
{"objectID": "1a3d32ab72f7e3db0bcdfe7455039aa4", "title": "West Virginia - Valley Health", "body": "Subscribe to receive information about NYU Langone Dental Medicine Postdoctoral Residency Programs.\n\nAEGD Positions Available for 2022\nFor more information, visit AEGD Positions Available for 2022.\nValley Health System’s dental program offers an accredited one year Advanced Education in General Dentistry Program (AEGD) with a mission to provide a robust and diverse advanced education experience to individuals planning a career in general dentistry. Valley Health (www.valleyhealth.org) is a network of community health centers that provides primary and preventative care to approximately 65,000 patients each year in southern West Virginia, southeastern Ohio and eastern Kentucky.\nValley Health is located in Huntington, WV, recently named one of “America’s Best Communities” (www.cityofhuntington.com). Huntington is located on the Ohio River and offers a vibrant downtown with easy access to housing, entertainment, restaurants and multiple festivals throughout the year. Huntington is also home to Marshall University, a historic public university with a student body of over 13,000 students (www.marshall.edu). Marshall University provides the community with many cultural events through the School of Performing Arts as well as NCAA Division 1 sporting events as a member of Conference USA (www.conferenceusa.com). The Marshall University Medical Center includes schools of medicine, pharmacy, and physical therapy. For outdoor enthusiasts, West Virginia is “Almost Heaven”.\nOur AEGD program emphasizes comprehensive oral health care as part of integrated primary health care system. You will learn to provide dental care to medically compromised patients by working in concert with Valley Health medical experts in pediatrics, internal medicine, family medicine, OB/GYN, ENT, behavioral health and pharmacy. Our mission at Valley Health is to provide access to care for the underserved. As such, we have a vast pool of patients with diverse unmet dental needs with few or no specialty resources that offers you the opportunity to learn how to manage complicated cases and enhance your clinical skills in all aspects of general dentistry. You will also have the opportunity to rotate through our walk-in clinic that will challenge your critical thinking and diagnostic skills to learn to effectively deal with emergent dental problems.\nOur training centers at Valley Health-East Huntington, Westmoreland, and Wayne are modern facilities that each house a medical, dental, and a behavioral health department. Valley-Health East Huntington and Wayne also include a pharmacy department with pharmacy residents and an optometry department. Each center is fully equipped with modern equipment that includes Dentrix electronic dental records, digital radiography, nitrous oxide, and an endodontic rotary and obturation system.\nAs part of the Valley Health oral health team, you will be afforded additional educational opportunities over and above the AEGD didactic requirements. You will be participating in our dental section meetings that include lunch and learn opportunities on innovative products and techniques from dental vendors, interesting and unusual case presentations by Valley Health dentists, and discussion of staff, personnel management, insurance, billing, and account receivable issues. Valley Health also conducts general provider (all disciplines) meetings that focus on general themes including risk management, quality assurance and improvement as well as other topics of general interest. Other training sessions are offered throughout the year by the human resources department on such topics as leadership training and conflict resolution and by the nursing department on basic CPR and Narcan administration as well as other subjects.\n3377 Route 60 EastHuntington, WV 25705\nDr. Andrea Kelly Dental Director akelly@valleyhealth.organdrea.kelly@nyulangone.org \n\n\nValley Health- East Huntington3377 Route 60 EastHuntington, WV 25705\nValley Health- Westmoreland2908 Auburn RoadHuntington, WV 25704\nValley Health- Wayne42 McGinnis DriveWayne, WV 25570\n© 2021 NYU Langone Health. All Rights Reserved. The contents of this communication are for informational purposes only and do not constitute an endorsement or promotion of the external entity or any of its products or services.\nSitemap       Terms &amp; Conditions       Privacy Guidelines", "Program Name": "NYU Langone Dental Medicine - Valley Health Systems West Virginia", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.nyulangonedental.org/programs/wv/valley-health/aegd", "keywords": ["aegd program", "behavioral health", "informational purposes", "internal medicine", "nitrous oxide", "digital radiography", "other subjects", "dental vendors", "public university", "clinical skills"]},
{"objectID": "05f1c4031ddce300c1f366c35769ae95", "title": "Internships And Fellowships | VA Augusta Health Care | Veterans Affairs", "body": "VA Augusta health care provides training programs for students at the college, university, and postgraduate levels. Explore our training programs to find out about how we can help you start your career as a health care professional.\nProgram Structure\nThe Charlie Norwood VAMC offers a 12-month post-graduate year one (PGY1) residency program that is designed to build upon the Doctor of Pharmacy (PharmD) education and outcomes in order to contribute to the development of clinical pharmacists responsible for medication-related care of patients with a wide range of conditions. This residency program aims to train pharmacists to provide pharmaceutical care to ambulatory and acute care patients as a member of the health care team, and to provide education to patients and health professionals. In addition to patient care, residents will participate in research, medication safety reporting, precepting and teaching (including precepting students and presenting ACPE approved CE presentations). Residents will be encouraged to develop an approach to the profession that can lead to life-long learning and career satisfaction.\nThe program consists of required, elective and longitudinal learning experiences.\nRequired Rotations:\n Required Longitudinal Experiences:\n Elective Rotations (not all inclusive):\n Benefits:\nHow to Apply\nApplication Requirements\nThe applicant must be a U.S. citizen, graduate of an accredited school of pharmacy, and hold an active pharmacy license or be eligible for licensure in any U.S. state or territory. All applicants must participate in the ASHP Resident Matching Program and complete a pre-employment background check and screening.\n \nApplication Process\nCandidates should complete a standard application in the Pharmacy Online Residency Centralized Application Service, PhORCAS, at http://www.ashp.org/phorcas. Requirements for completed applications include:\nApplication Deadline\nAll application materials must be submitted via PhORCAS by January 3, 2022.Interview Notification\nCandidates will be notified of interview status no later than the end of February each year.\n \nPosition appointment\nApplicants must meet all requirements for federal employment.\nNote: The CNVAMC pharmacy residency program agrees that no person at this site will solicit, accept, or use any ranking-related information from any residency applicant. The program adheres to the rules of the ASHP Pharmacy Resident Matching Program.\nProgram Structure\nThe Charlie Norwood VAMC offers a 12-month post-graduate year one (PGY1) residency program that is designed to build upon the Doctor of Pharmacy (PharmD) education and outcomes in order to contribute to the development of clinical pharmacists responsible for medication-related care of patients with a wide range of conditions. This residency program aims to train pharmacists to provide pharmaceutical care to ambulatory and acute care patients as a member of the health care team, and to provide education to patients and health professionals. In addition to patient care, residents will participate in research, medication safety reporting, precepting and teaching (including precepting students and presenting ACPE approved CE presentations). Residents will be encouraged to develop an approach to the profession that can lead to life-long learning and career satisfaction.\nThe program consists of required, elective and longitudinal learning experiences.\nRequired Rotations:\n Required Longitudinal Experiences:\n Elective Rotations (not all inclusive):\n Benefits:\nHow to Apply\nApplication Requirements\nThe applicant must be a U.S. citizen, graduate of an accredited school of pharmacy, and hold an active pharmacy license or be eligible for licensure in any U.S. state or territory. All applicants must participate in the ASHP Resident Matching Program and complete a pre-employment background check and screening.\n \nApplication Process\nCandidates should complete a standard application in the Pharmacy Online Residency Centralized Application Service, PhORCAS, at http://www.ashp.org/phorcas. Requirements for completed applications include:\nApplication Deadline\nAll application materials must be submitted via PhORCAS by January 3, 2022.Interview Notification\nCandidates will be notified of interview status no later than the end of February each year.\n \nPosition appointment\nApplicants must meet all requirements for federal employment.\nNote: The CNVAMC pharmacy residency program agrees that no person at this site will solicit, accept, or use any ranking-related information from any residency applicant. The program adheres to the rules of the ASHP Pharmacy Resident Matching Program.\nThe Augusta University/Medical College of Georgia-Charlie Norwood Veterans Affairs Medical Center\nPsychology Internship (AU/MCG-Charlie Norwood VAMC Psychology Internship) was formed with the guiding principle that synergy could be achieved by pooling resources and interrelating institutional education, clinical service, and research efforts to enhance psychology internship training. Provision of care in interdisciplinary health care settings is a focus of our internship training and our training model focuses on three primary facets of training in the development of professional psychologists: (1) Training in the implementation of essential practice skills in key field settings; (2) Training in an empirical approach to practice (fostering attitudes of empiricism and reflection), and; (3) Training in the provision of care for underserved populations and areas.\nFor additional information, please visit: https://www.augusta.edu/mcg/psychiatry/psychology/\nEligibility requirements for all VA Psychology Training Programs\nAm I Eligible? Checklist for VA HPTs\nApplication Deadline: November 1, 2021\nInterviews: Interviews will be held virtually on Mondays and Fridays in December 2021 and January 2022. An optional, non-evaluative Open House will be offered in late January 2022 for applicants who are interested in visiting Augusta to inform their ranking. \nContact\nThe AU/MCG-Charlie Norwood VAMC Psychology Internship is fully accredited by the American Psychological Association Commission on Accreditation (APA-CoA).\nQuestions related to the program's accreditation status should be directed to the APA Commission on Accreditation:\nOffice of Program Consultation and Accreditation\nAmerican Psychological Association\n750 1st Street, NE\nWashington, DC 20002-4242202-336-5979\nemail: APAACCRED@APA.COM\nwebsite:  www.apa.org/education-career/grad/program-accreditation\nThe Clinical Psychology Postdoctoral Fellowship at the Charlie Norwood VA Medical Center offers training in two areas of emphasis – Inter-professional Team-Based Care (2 positions), and Military Sexual Trauma (1 position). The program received 10-year accreditation in 2019 by the Commission on Accreditation of the American Psychological Association.\nDownload the Clinical Psychology Postdoctoral Fellowship Brochure\nRequirements: Applicants must be United States citizens, have obtained a doctoral degree in psychology from an APA-accredited doctoral program, and completed an APA-accredited psychology internship. Males must have registered with the US Selective Service System before the age of 26.\nEligibility requirements for all VA Psychology Training Programs\nAm I Eligible? Checklist for VA HPTs\nApplication Deadline: January 3, 2022\nInterviews: Interviews will be held virtually in January/February 2022.\nContact\nDr. Katrina Speed\nPsychology Training Director (Acting)\nKatrina.Speed@va.gov\n706-733-0188 ext. 25800\nThe Clinical Psychology Postdoctoral Fellowship at the Charlie Norwood VA Medical Center is fully accredited by the American Psychological Association Commission on Accreditation (APA-CoA).\nQuestions related to the program's accreditation status should be directed to the APA Commission on Accreditation:\nOffice of Program Consultation and Accreditation\nAmerican Psychological Association\n750 1st Street, NE\nWashington, DC 20002-4242202-336-5979\nemail: APAACCRED@APA.COM\nwebsite:  www.apa.org/education-career/grad/program-accreditation\nCharlie Norwood Veterans Affairs Medical Center\nOne Freedom Way\nAugusta, Georgia 30904  \n \nFAQ Central Savannah River Area CPE Program at Charlie Norwood VA Medical Center.pdf  \n \nOffering\nLevel I CPE\nLevel II CPE\nOne Year Residency &amp; Extended Units Offered\n \nAssociation for Clinical Pastoral Education, Inc\n55 Ivan Allen Jr. Boulevard, Suite 835\nAtlanta, Georgia 30308\n404-320-1472\nwww.acpe.edu\n \nThe Charlie Norwood VAMC is a two-division Medical Center that provides tertiary care in medicine, surgery, neurology, psychiatry, rehabilitation medicine, and spinal cord injury. Chaplain Service meets the spiritual needs of veterans and families through routine visitation, interdisciplinary functions, regular and seasonal chapel services, memorial services, and 24/7 emergent availability.\n \nResidency Program: 4 Positions (an additional 1-2 positions may be offered through AUH and/or University Hospital who are educational affiliates with Charlie Norwood VAMC).\n \nTour of Duty: 7:30am-4:00pm and weekly call back rotation duties with Clinical Staff Chaplain.\n \nTo apply: Send an ACPE application (cpe-application-2021.pdf (acpe.edu)) to Charlie Norwood VAMC; Chaplain Service; One Freedom Way-125U; Augusta, Georgia 30904.\n \nChaplain Lynn Brown-Duffy (ACPE Certified Educator) can be reached at (706) 733- 0188 Extension 26113. The e-mail address is lynn.brown-duffy@va.gov.\n \nThe Charlie Norwood Veterans Affairs Medical Center is an equal opportunity employer.\n \nAll prospective students must meet Federal Employment and VA Qualification Standards.\n \n \nWelcome to the Charlie Norwood VA Medical Center Residents/Fellows Onboarding Site\nTo participate in your chosen program at the VA, you will need to complete the following Onboarding requirements. Part 1 should be completed a minimum of 90-120 days before your start date. If not completed timely, this may delay or remove entry into your rotation. \nPlease work closely with your VA Point of Contact(link below) to avoid any unnecessary delays; these department liaisons are available to help and answer your questions.\nPart 1 – Required from Resident: Start 90-120 days prior to rotation\nPart 2: Mandatory Training requirements:\nYou must create an account in the VA’s Talent Management System (TMS) and complete the assigned training to obtain computer and patient access. You are required to complete this training which comes in two options; an online course titled Mandatory Training for Trainees, (MTT):  TMS# 3185966 for new users and Refresher Course, (MTT):  TMS# 3192008 for returning trainees.\nYour position requires you to have personal access to the CPRS Medical Records. Complete the CPRS Tab by Tab training VA 35795 in TMS and return your training certificate.\n This training covers the basic aspects of using the VA Computerized Patient Record System (CPRS). Learners will experience each tab of the CPRS, basic operations &amp; how they may customize settings to make more efficient use of the system. It will equip the new employee with the skills necessary to navigate the electronic health record and provide existing employees ongoing training and job aids they can use to build their CPRS skills while working in their professional capacity.\nVA Forms – Please follow these instructions carefully to avoid having your paperwork returned:  Tips for Completing Your VA Paperwork(link below)\nThese forms are required for onboarding:\nIf you have any general questions, please contact the Education Office contact listed on this page or your department/service point of contact. \nCONTACT\nLatonya D. Johnson \nSupervisor Affiliations &amp; Hospital Education Service (33) \nU. S. Department of Veterans Affairs Southeast Network (VISN7)  \nCharlie Norwood VA Medical Center\nOne Freedom Way 3B-119 | Augusta, Georgia 30904  \n' 706-733-0188 ext. 26852 | 7706-731-7184 | *  Latonya.Johnson3@va.gov\n \n \n \nLast updated: April 29, 2022", "Program Name": "V.A. Medical Center, Augusta, GA - Charlie Norwood", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.va.gov/augusta-health-care/work-with-us/internships-and-fellowships/", "keywords": ["elective rotations", "emergent availability", "spiritual needs", "unnecessary delays", "professional psychologists", "essential practice", "seasonal chapel", "graduate year", "personal access", "selective service"]},
{"objectID": "51edf487ce15bb50698c167085fc3608", "title": "Advanced Education in General Dentistry | College of Dentistry | University of Nebraska Medical Center", "body": "Supportive Learning Community  |  Diverse Patient Base  |  Extraordinary Opportunities\nUpon successful completion of the one-year AEGD residency program, the resident will receive a certificate.\nLength of Program: 12 months Application Deadline: March 15 Start Date: July 1 Positions Available: 6 Location: Durham Outpatient Center, Omaha, Nebraska Rotations: - Federally Qualified Health Centers in Nebraska to provide health care to underserved communities- UNMC College of Dentistry Lincoln Clinic to treat patients with complex needs- UNMC College of Dentistry Pediatric Dental Clinic at Children’s Hospital &amp; Medical Center in Omaha\nThe program in advanced education in general dentistry (12 month) is accredited by the Commission on Dental Accreditation and has been granted the accreditation status of “approval without reporting requirements.” The Commission is a specialized accrediting body recognized by the United States Department of Education. The Commission on Dental Accreditation can be contacted at 312-440-4653 or at 211 East Chicago Avenue, Chicago, IL  60611. The Commission’s web address is: http://www.ada.org/en/coda.  \nThe Commission on Dental Accreditation has accredited the program in advanced education in general dentistry (12 month). However, accreditation of the program does not in itself constitute recognition of any dental specialty status. \nThe purpose of the UNMC College of Dentistry's AEGD program is to train recent dental school graduates to deliver comprehensive dental care to a wide range of patients with varying needs, in different clinical environments at an advanced level of skill and/or complexity beyond that accomplished in their pre-doctoral education. The resident’s basic knowledge and skills will be reinforced and expanded in the areas of pathology, diagnosis, treatment planning, and clinical and preventive dentistry, dental emergencies and pain and anxiety control utilizing behavioral and/or pharmacological techniques. In addition, the resident will be exposed to advanced training in the areas of endodontics, prosthodontics, orthodontics, oral surgery, periodontics, pediatric dentistry, implantology, TMD and restorative dentistry. Furthermore, the program strives to instill in the resident, practice management and production skills that will translate into their private practices upon completion of the residency program. Finally, it will reinforce the necessity of lifelong learning and strengthen critical thinking to apply evidenced based patient care.\nGoals and Objectives of the Program\nThe Commission on Dental Accreditation describes the goals of an AEGD as follows: Advanced Education Programs in General Dentistry are educational programs designed to provide training beyond the level of pre-doctoral education in oral health care, using applied basic and behavioral sciences. Education in these programs is based on the concept that oral health is an integral and interactive part of total health. The programs are designed to expand the scope and depth of the graduates’ knowledge and skills to enable them to provide comprehensive oral health care to a wide range of population groups. The goals of these programs should include preparation of the graduate to:\nUpon successful completion of the one-year AEGD residency program at UNMC, the resident will receive a certificate. The following criteria will be utilized in evaluating the resident for certification. As part of the current competency and proficiency movement in postgraduate general dentistry, it will be the resident’s responsibility to provide documentation of their experiences during the residency. (Competency statements are available on-site for review or are available upon request.) Documents will be gathered and presented for review by the faculty on a periodic basis. Documents will be stored through the use of a portfolio. Criteria for successful evaluation will be:\nProgram Director - The program has a director responsible for the day-to-day administration of the clinic. The director also spends a significant percentage of time with the residents in both clinical and educational components of the program.\nAttending Staff - Residents receive guidance, supervision, education and treatment planning advice from both generalists and specialists throughout the program. Specialists are available for consultation on a regularly scheduled basis and include endodontics, oral pathology, oral surgery, pediatric dentistry, periodontics, prosthodontics, and oral-maxillofacial prosthetics. Patients are scheduled by the residents for consultation or supervision of treatment with a specialist when the resident feels the patient has need for special consideration.\nSupport Staff - Residents are provided with dental assistant support to allow for utilization of four-handed dentistry. A billing / insurance specialist and clinic scheduler are available to ensure efficient administration of patient scheduling, records and finances. Dental hygienists are also employed to help provide preventive, diagnostic, periodontal and other adjunct services to our patients.\nAttending Staff and Adjunct Faculty\nUNMC College of Dentistry Dental ClinicThe UNMC College of Dentistry Dental Clinic is located in the University of Nebraska Medical Center Durham Outpatient Center. The clinic was renovated in 2019. The project included 15 fully equipped operatories, a laboratory, sterilization area, radiographic imaging room with a digital pantomograph unit, resident's room, scheduling office, billing office, large waiting room and restrooms.\nThe dental operatories in the clinic are fully equipped. The clinic utilizes a digital radiographic system and computer workstations for chairside use. The dental units are state-of-the-art equipment with fiber optic capabilities. A surgical endodontic microscope and CEREC Omnicam and Blue-cam with a milling unit for porcelain restoration fabrication are also available for resident’s use. Rotary Endodontic and Implant Placement Systems, including handpieces, are frequently utilized as well as a soft-tissue laser. Several new complete sets of oral surgery instruments are available. A portable radiographic unit (Nomad) and dental unit as well as two portable pulse oximeters are available for treatment rendered in the operating room or on the patient floors.\nLibrarySince the program is located at the University of Nebraska Medical Center in Omaha, an extensive library facility is immediately available for the resident's use. The McGoogan Health Sciences Library within the University Hospital has all necessary medical and most major dental publications. The C.Y. Thompson Library in Lincoln can supply other dental references or minor publications required for resident use. Library loan or courier service can provide journals, articles or books quickly. In addition, extensive audiovisual files are in the Medical Center Library for the resident's review. Computer access to internet reference sites is available in the clinic's resident room.\nDental residents spend approximately 75% of their time providing dental care to a wide variety of patients. These groups include:\nResidents will participate in the screening of patients admitted to the program and the development of definitive treatment plans. The treatment plans are presented to the attending staff in the dental clinic and at weekly treatment planning meetings. At that time, the attending staff will review the treatment plan with the residents and make recommendations, review options of treatment and discuss rationale of treatment plan decisions. An active Nebraska state dental license is necessary to participate in this program and to receive the stipend. Incoming residents will be provided with additional information regarding temporary state licensure.\nSpecial emphasis is given to oncology, liver transplant, heart transplant, pancreas transplant, cardiac valve replacement, HIV patients and their problems. The dental residency program works closely with these services preparing and managing these patients.\nTraining in physical evaluation will be provided during the first months of the program to allow the residents to more actively participate in the care of patients.\nSafe Work EnvironmentThe program follows State, Federal, and National regulatory bodies with respect to asepsis and safety within the workplace. Emergency preparedness and safe work environment materials are available for review. Some of these documents will be provided to the resident during orientation.\nA number of educational programs have been developed for the dental residents. These educational programs are designed to provide the residents with additional exposure to both medical and dental problems and developments. The following programs are regularly scheduled for the resident's benefit:\nEducational seminars presented by the attending staff, guest lecturers or medical/dental specialists will focus on advanced techniques in the individual's specialty or interest areas. Educational seminars presented by the residents will focus on management of dental patients with special needs or complex management and on implant placement/restoration patient cases.\nOral pathology conferences are presented by an oral pathologist. The conferences review and augment the resident's knowledge of oral and general pathology as well as oral medicine.\nOral surgery conferences are presented by various medical or oral surgery attending staff or residents. The subjects covered include a variety of dental and medical problems, techniques important to diagnosis and management of patients and techniques or problems in oral surgery. Seminar subjects will cover basic and special considerations for inpatient and outpatient care of dental patients undergoing combined medical and dental procedures. Principles of fluid balance, laboratory interpretation, pain management, TMJ disorders, infection and medication management are just a few examples of subjects presented. A physical assessment course is also provided through the Oral Surgery Service.\nA six-week lecture course on a restorative approach to implants is also provided with the oral surgeons—this addresses both surgical and restorative aspects of implant placement and restorative. Implant case conferences are held at the VA amongst the prosthodontist, generalists, oral surgeons and residents to discuss cases prior to implant placement and to achieve the best results surgically and restoratively.\nTreatment planning/case review seminars are monthly presentations of difficult or unusual dental patients. The residents are requested to present the patient's medical and dental problems, how they affect the patient and his/her treatment, and what treatment was prescribed and carried out.\nDistance Learning PolicyDidactics are available remotely utilizing Zoom teleconferencing. To assure academic integrity, and to maintain security and privacy, residents gain access to course materials and educational resources by means of secure login authentication. Upon admission to UNMC, each resident is assigned a unique electronic identity, which is protected by a password. All communications are managed through the secured learning management system, including contact with the instructor and collaboration with peers. The submission of assignments, and accessing grades are not planned to be communicated through remote learning. Attendance and verification are also easily accomplish via simple voice and video identification during live broadcast teleconferences. There is no charge to the residents for distance education.\nEmergency On CallResidents will provide emergency on call while at the College of Dentistry in Lincoln when on rotation there.\nOff-Service Rotations\nEach rotation is expected to enhance and enrich the resident’s experiences. The clinic directors at each site will be invited to participate in orientation activities or participate as available in an orientation week held in July in order to review program goals and objectives and conduct calibrations. They will be responsible for supervising the residents and providing evaluations of the resident’s performance.\nImmunizationsThe University of Nebraska Medical Center College of Dentistry policy requires that all entering students in programs requiring patient contact must be vaccinated or exhibit active immunity to tetanus, measles*, mumps, diphtheria, chicken pox, polio, rubella and Hepatitis B and have had a TB skin test within the last six months, unless the student has a previous positive test/medical contraindication. Each entering student must verify at the time of matriculation that he or she has completed the accepted routine of vaccinations. An immunization record is required in order for the student to be registered. *Anyone born after 1957 is required to have two measles shots to assure immunity, with the second one given after 1980.\nCardiopulmonary Resuscitation (CPR)Each student is required to be certified and maintain certification in basic CPR provided by the American Heart Association. A copy of the current and valid certification in basic CPR must be maintained at the College of Dentistry. Certification in Advanced Life Support (ACLS) also is encouraged.\nStipendThe estimated stipend will be approximately $40,000, and is not determined until June of the residency year. GME-eligible postgraduate students are eligible for a flexible benefit package which includes choices among health, life, and disability insurance. Future income is contingent upon continued availability of federal funds and, therefore, is subject to change at any time.\nThe dental resident will be responsible for the timely payment of established program fees and will receive a salary. Established program fees which are the responsibility of the resident include $1,025 per semester equipment tax fee ($2,050 total) and background check fee of $30.\nStudent Loans and Loan DefermentCurrently, postgraduate students are considered students of the College of Dentistry for financial aid purposes. Postgraduate students may get financial aid information from the UNMC Financial Aid Office and student loan payments for postgraduate students can be deferred.\nVacation/Sick LeavePostgraduate students shall have fifteen (15) scheduled working days of paid Leave per year. Leave includes vacation, sick leave, and professional development leave. Leave in excess of fifteen (15) days per year must be taken as Leave Without Pay from the College or as Family Leave. Such extended leave may result in extension of the training program without pay. Leave requests must be submitted as per the policies of the program and the College.\nPrivate PracticeStudents are allowed to participate in private practice (moonlighting activities) but must arrange their schedules with the program co-directors to prevent conflict with program responsibilities.\nState of Nebraska ResidencyAs employees of the University, GME-eligible postgraduate students are considered residents of the State of Nebraska.\nThe University of Nebraska has in force professional liability insurance covering all enrolled students of the College of Dentistry performing services as part of the College's program.\nCurrent coverage is $1,000,000.00 per person, per occurrence, with $100,000.00 deductible. The University provides self-insurance for the $100,000.00 deductible through the University's general and professional liability insurance program.\nAll postgraduate students are expected to get a Nebraska Dental License (temporary or regular) and federal and state DEA licenses before October 15 of the year of the commencement of their program. The postgraduate student must document efforts to obtain licensure to the Postgraduate Admissions Office by July 15. Failure to obtain Nebraska Dental License and federal and state DEA licenses by October 15 may result in a reduction of duties, reduction or elimination of stipend, an extension of time necessary to complete program requirements, or dismissal from the program. Failure to obtain licensure or maintain licensure during the course of the residency will result in dismissal from the program and no certification of participation.\nIt is possible for a student who has graduated from an A.D.A. accredited American or Canadian Dental School to obtain a temporary Nebraska Dental License during the time he or she is enrolled as a full-time postgraduate student. The temporary license is only for practice related activities within the College of Dentistry and does not allow extramural private practice. After acceptance into the postgraduate program licensure information may be obtained from the State of Nebraska Department of Health, Bureau of Examining Boards.\nFor a regular license, the State Board accepts the results of the clinical examination given by the C.O.R.E. in 1995 (CRDTS/NERB), or CRDTS. The State Board also has provisions for licensure by credentials for individuals licensed by other states.\nApplicant EligibilityStudents accepted for postgraduate training in the advanced education in general dentistry residency program must have a dental degree from a U.S.A. American Dental Association-accredited dental college or school. Selection FactorsAdditional criteria upon which applications are viewed include:\nApplicant ProcessThe Advanced Education in General Dentistry program participates in PASS, but not match. All applicants must follow the guidelines established by this service to be eligible for the program.\nIn accordance with University policy, UNMC prohibits the denial of admission or of Medical Center privileges to students or applicants on the basis of race, color, sex, national origin, age, disability or religious or political beliefs. These privileges include but are not limited to admission, class assignments, scholarships, fellowships, assistantships, and financial aid, as well as housing and recreational facilities. Furthermore, student organizations must base their selection of students for membership in criteria which will not include race, color, religion, sex, national origin, age or disability.\nAdmittance to UNMC programs will not be denied to otherwise qualified disabled individuals solely by reason of their disability. Qualified disabled persons are those who meet the academic and technical standards for each program. These nonacademic skills are essential to successful program completion.\nIn summary, UNMC policies are in accord with:\nThe objective of the University of Nebraska Medical Center is to recruit and retain persons of high moral and ethical character. In accordance with this objective, the University of Nebraska Medical Center reserves the right to review a candidate's suitability for admission.\nJay D Hansen, DDSProgram DirectorUNMC College of Dentistry Dental Clinic (Omaha)989375 Nebraska Medical CenterOmaha, NE 68198-9375402-559-4885jay.hansen@unmc.edu\nPostgraduate Dental Programs Julie Buss UNMC College of Dentistry 4000 East Campus Loop SouthLincoln, NE 68583-0740402-472-6261jbuss@unmc.edu", "Program Name": "University of Nebraska Medical Center", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.unmc.edu/dentistry/programs/postgraduate/aegd.html", "keywords": ["complete sets", "dental references", "dental clinic", "adjunct faculty", "periodic basis", "live broadcast", "secure login", "second one", "professional development", "remote learning"]},
{"objectID": "b61e811218fd999ee786e12e623547a4", "title": "California - Gary and Mary West Senior Dental Center - AEGD", "body": "Subscribe to receive information about NYU Langone Dental Medicine Postdoctoral Residency Programs.\n1525 4th Avenue, 2nd floorSan Diego, California 92101\nDr. Karen BecerraKaren.becerra-penagos@nyulangone.org \nGary and Mary West Senior Dental Center1525 4th Avenue, 2nd floorSan Diego, California 92101\nGary and Mary West Senior Dental Center-San Marcos1706 Descanso Ave suite aSan Marcos, California 92078\n\n© 2021 NYU Langone Health. All Rights Reserved. The contents of this communication are for informational purposes only and do not constitute an endorsement or promotion of the external entity or any of its products or services.\nSitemap       Terms &amp; Conditions       Privacy Guidelines", "Program Name": "NYU Langone Dental Medicine - San Diego, CA - Gary & Mary West Senior Dental Center", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.nyulangonedental.org/programs/ca/gary-and-mary-west-senior-dental-center/aegd", "keywords": ["informational purposes", "dental medicine", "4th avenue", "external entity", "dental center"]},
{"objectID": "4e498d599a5f700d1380909c5ab036e2", "title": "Montana - Rubicon Dental Network - AEGD", "body": "Subscribe to receive information about NYU Langone Dental Medicine Postdoctoral Residency Programs.\n\n***An unrestricted dental license to practice in the state of Montana is required of our residents*\n\n \n\nWhat is the mission of your training site?RDN was established in 2020 to provide comprehensive general dental care, with each rotation site providing experiences in various areas of advanced dentistry. With a strong interest in dental education, RDN houses an AEGD program and also serves as a rotation site for RiverStone Health, a community-based public health entity.\nWhat types of dental services can I expect to perform? \n\nWhat types of technologies can I expect to use? \nWhat is the patient population? RDN is located in Billings, MT which has a population of approximately 110,000 as of 2019. The Billings population has a median age of 36.8 and a median household income of $57,172. The 5 largest ethnic groups in Billings, MT are White (Non-Hispanic) (85.1%), White (Hispanic) (4.65%), American Indian &amp; Alaska Native (Non-Hispanic) (4.22%), Two+ (Non-Hispanic) (2.61%), and Black or African American (Non-Hispanic) (0.722%). RDN serves populations of all race/ethnicity and genders. RDN is not specifically geared toward serving patients with special needs; however, many of our patients are medically complex. RDN accepts all insurances, including Medicare and Medicaid, with the majority of our patients being privately insured or self-pay. RDN receives referrals from a variety of colleagues in the area, with a strong commitment to public health and serving the underserved for optimal oral health and access to care. RDN has a wide referral base that is mutually beneficial, including other Rubicon network practices, area private practices, RiverStone Health, Bighorn Valley Public Health, and Indian Health Services. RDN implemented a Resident Education Fund in 2021 to enhance residents’ clinical learning experiences and provide quality care to our patient pool\nWhat is life like outside of the training site? Billings is the largest city in the U.S. state of Montana, with a population estimated at 109,577 as of 2019.[5] Located in the south-central portion of the state, it is the seat of Yellowstone County and the principal city of the Billings Metropolitan Area, which had an estimated population of 180,385 in 2018.[6] It has a trade area of over 500,000.[7]\nBillings was nicknamed the \"Magic City\" because of its rapid growth from its founding as a railroad town in March 1882. With one of the largest trade areas in the United States,[8] Billings is the trade and distribution center for much of Montana east of the Continental Divide, Northern Wyoming, and western portions of North Dakota and South Dakota. Billings is also the largest retail destination for much of the same area.\nArea attractions include Pompey's Pillar, Pictograph Cave, Chief Plenty Coups State Park, Zoo Montana, and Yellowstone Art Museum. Within 100 miles are Little Bighorn Battlefield National Monument, Bighorn Canyon National Recreation Area, Red Lodge Mountain Resort, and the Beartooth Highway, which links Red Lodge to Yellowstone National Park.\n(Reference https://en.wikipedia.org/wiki/Billings,_Montana )\n\nWill residents have the opportunity to restore and/or place implants at your training site?Residents will have extensive learning opportunities in both restoration and placement of implants at RDN.\n\nWill residents treat children in your training site?RDN is a general practice and children are welcome for treatment. However, the focus of the practice is not pediatric dentistry.\nRubicon Dental Network- Montana Center For Implant Dentistry1690 Rimrock Road, Suite DBillings, Montana 59102www.montanaimplants.com\n\nRubicon Dental Network- Hardin Family Dental837 N Center StHardin, MT 59034www.hardinfamilydental.com\n\nRubicon Dental Network- Midtown Dental918 Grand AveBillings, MT 59102www.billingsmidtowndental.com \nRubicon Dental Network- Canyon Creek Dental1690 Rimrock Rd Suite CBillings, MT 59102www.hardinfamilydental.com\n© 2021 NYU Langone Health. All Rights Reserved. The contents of this communication are for informational purposes only and do not constitute an endorsement or promotion of the external entity or any of its products or services.\nSitemap       Terms &amp; Conditions       Privacy Guidelines", "Program Name": "NYU Langone Dental Medicine - Billings, MT - Montana Center for Implant Dentistry (Rubicon)", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.nyulangonedental.org/programs/mt/Rubicon-Dental-Network/aegd", "keywords": ["aegd program", "red lodge", "informational purposes", "resident education", "rapid growth", "median household", "magic city", "strong interest", "dental care", "metropolitan area"]},
{"objectID": "071b08b0569e752b4a02478f3f1d4e9a", "title": "Advanced Education in General Dentistry Residency | Ballad Health", "body": "The general dentistry, family medicine and internal medicine residency programs at Johnston Memorial Hospital are committed to providing advanced, innovative and specialized training in general dentistry, osteopathic family medicine and internal medicine.\nUpon completion of residency training, the dentist will be well prepared to serve the community by practicing comprehensive dentistry and caring for diverse populations.\nThe AEGD dental residency program boasts a competitive salary and excellent benefits.\nOur dental residency programs feature a comprehensive training experience where participants learn the skills required to provide all-inclusive care.\nSee the AEGD residency curriculum.\nJohnston Memorial Hospital is affiliated with quality dental clinics located in Virginia and Alabama provide access to quality faculty and a wide range of clinic experiences.\nPlease contact us, or call (276) 258-4435 to request more information about Ballad Health’s AEGD dental, osteopathic family medicine and internal medicine residency programs at Johnston Memorial Hospital. For specific information on the dental residency program you can also make an online request.\nOr use the following mailing address for all graduate medical education at Johnston Memorial:\nAttn: Graduate Medical Education, 4th floor\nJohnston Memorial Hospital\n16000 Johnston Memorial Drive\nAbingdon, VA 24211\nApplicants typically submit their materials through the American Dental Education Association Postdoctoral Application Support Service (PASS). Search for the following Program Numbers:\nAEGD 1592:  Johnston Memorial Hospital – AbingdonAEGD 1593:  Johnston Memorial Hospital – Foundry Dental Center\nTo be eligible for the program the applicant must be a US Citizen and be attending or have graduated from an accredited US Dental School or Canadian Dental School.\nEach applicant should file an application through the training program’s respective match process, provide:", "Program Name": "Johnston Memorial Hospital - Abingdon, VA", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.balladhealth.org/residencies/dental-aegd-abingdon-jmh", "keywords": ["online request", "internal medicine", "excellent benefits", "specific information", "dental center", "respective match", "general dentistry", "diverse populations", "competitive salary", "inclusive care"]},
{"objectID": "d3ba9ec14a4183007e430eeb30e4baa2", "title": "Idaho Advanced General Dentistry | Idaho State University", "body": "Common Searches\nIdaho State University sponsors the Idaho Advanced General Dentistry Program, an Advanced Education in General Dentistry Residency. The goal of the program includes increasing the knowledge and clinical skills of the general dentist beyond that achieved in the pre-doctoral education. Through an integrated multidisciplinary learning environment, residents are able to increase their competence in the application of modern standards of care and practice management.\nThis one-year residency focuses on providing comprehensive care in a variety of clinical settings, emphasizing rural, underserved, and at-risk populations. Residents also receive training with patients who have emergency or episodic needs. A certificate is awarded upon the successful completion of the program.\n\n larsjeri@isu.edu\n (208) 282-3289\n (208) 282-5834\n \n\nCampus Box 8088\nPocatello, ID 83209-8088\nIDAHO STATE UNIVERSITY\n\n(208) 282-4636\n                          921 South 8th Avenue | Pocatello, Idaho, 83209", "Program Name": "Idaho State University", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.isu.edu/dentalsciences/idaho-advanced-general-dentistry/", "keywords": ["general dentistry", "successful completion", "general dentist", "episodic needs", "common searches", "clinical settings", "modern standards", "clinical skills", "advanced education", "multidisciplinary learning"]},
{"objectID": "73d47ccaf35d75775539b942b29d5afd", "title": "Advanced Education In General Dentistry | VA Maine Health Care | Veterans Affairs", "body": "The Advanced Education in General Dentistry (AEGD) Program is a fully accredited  one-year post-doctoral  program in clinical dentistry with a didactic component in  general dentistry. The primary focus of this program is to improve the clinical skills taught in an undergraduate dental school program. \nProgram Description\nThe Advanced Education in General Dentistry (AEGD) Program is a fully accredited  one-year post-doctoral  program in clinical dentistry with a didactic component in  general dentistry. The primary focus of this program is to improve the clinical skills taught in an undergraduate dental school program. The clinical and didactic training and experiences are at a level of skill and complexity beyond that accomplished in a pre-doctoral program. The program currently accepts two residents per year. Each resident is assigned a modern, well-equipped dental operatory and a full-time chair-side dental assistant. The facilities and staff support all clinical, educational, and research activities of the program.\nClinical and didactic instruction covers the range of dental disciplines, emphasizing practice management and care for the medically compromised and dentally complex patients. Approximately 85% of time will be spent providing direct patient care and 15% will be directed toward non-clinical and didactic activities. 95% of our patients are out-patients.\n\nIn addition, the individual resident can identify major areas of interest, such as specific clinical disciplines or research. Upon satisfactory completion of the program, residents receive a certificate in Advanced Education in General Dentistry.\nDuty, Leave, Stipend\nAppointment One full year, starting approximately the first week in July (subject to change)\nClinic Hours 8:00 am to 4:30 pm, Monday - Friday\nAfter-Hours Call Duty\nResidents alternate, each covering every other week Monday-Friday\nAnnual Leave 10 days (vacation)\nAccumulates by approximately one day per month\nSick Leave Up to 7 days\nAccumulates by approximately one day every other month\nStipend: Approximately $55,000\nAdministrative Leave*Up to 5 days\n*5 days of official leave may be approved to attend professional meetings and continuing education courses and to take State Board Examinations. Any tuition or travel costs will be the responsibility of the resident.\n \nClinic and Facilities Description\nDental Clinic: The clinic consists of ten fully-equipped dental operatories and one oral surgery suite.  The clinic is equipped with a full complement of modern dental materials as well as a computerized patient record system, digital panoramic and intra-oral radiography, rotary endodontic equipment, and dental implant surgical and prosthetic equipment.  In addition, located within the clinic, is an i-CAT cone beam CT scan for use with complex cases that require high definition 3D diagnostic images. \nHospital scrubs and long sleeve clinic attire are provided daily. The dental laboratory, patient reception area, staff conference room, bathrooms and locker rooms are located within the clinic.\nDental Operatory: Single chair operatory with digital intra-oral radiography, intra-oral camera, and individual computer station and monitor for doctor and assistant.\nDental Lab: In-house dental lab with a full-time CDT who provides a full range of dental laboratory support, except for RPD frameworks and porcelain/ceramic crowns (both are sent to outside labs).\nAuxiliary Staff: Three full-time dental hygienists, eight full time dental assistants and one full-time receptionist.\nVA Facilities: Togus VA Medical Center is a 67-operating bed facility with general medical, surgical, intermediate and mental health beds, as well as a 100 bed Nursing Home. Opening in October 1866, Togus VAMC is the oldest veterans' facility in the country.  Togus is located approximately four miles east of Augusta, the state capital. The Togus campus encompasses 500+ acres of buildings and natural woodlands.  The first veteran was admitted to Togus on November 10, 1866. The campus also has an indoor gymnasium (with a workout equipment and a heated pool), cafeteria, post office, canteen store, ATM machine, chapel and outdoor tennis court, basketball court, softball field and walking trails.\nClinical Staff:\nFull-Time Staff:\nDr. Nicholas Sirois, Program Director\nDMD: Tufts Univ. School of Dental Medicine, 2011\nAEGD: VA Maine Healthcare Center, 2012\nGeneral Dentistry practice since 2012\nDr. John Coke, Assistant Chief of Dental Service\nD.D.S: Emory University, Atlanta, GA 1983\nGPR: University of Medicine and Dentistry of New Jersey, Newark, NJ 1984\nU.S. Air Force Dental Corps, 25 years\nGeneral Dentistry, VA Bangor CBOC since 2013\nDr. Heather Masters\nDDS: University of Maryland School of Dentistry, 2013\nAEGD: VA Maine Healthcare Center, 2014\nGeneral Dentistry, VA Bangor  since 2014\nDr. Myra S. Gay\nDDS: University of Texas Health Science Center at San Antonio 1997\nAEGD: Ft. Campbell, KY 1998\nGeneral Dentistry: Togus VAMC 2017\nDr. Alex Gale D.M.D:  University of Connecticut School of Dental Medicine, 2017\nAEGD: Togus VAMC, ME, 2018\nGeneral Dentistry, Togus VAMC since 2018\nDr. Jennifer Miedema\nDMD: University of New England CDM, 2017\nAEGD: VAMC Togus, ME, 2017-2018\nGeneral Dentistry, Togus VAMC since 2018\n Part-Time Staff\nDr. Donald Bandy, DDS\nD.D.S: University of Texas H.S.C., San Antonio, 1978\nGPR: General Leonard Wood Army Hospital, Ft. Leonardwood, MO, 1979\nOMFS: Walter Reed Army Medical Center, 1992\nDiplomate, American Board of Oral and Maxillofacial Surgeons, 1994\nConsulting Staff\nDr. Michael T. Cwiklinski\nDMD: U. of Pennsylvania,\nPeriodontics: Tufts University\nPrivate Practice, Portland, ME\nDr. Stephen Morse\nDMD: Tufts University,\nPeriodontics: Boston University\nPrivate Practice, Portland, ME\nDr. Todd Mellin\nDMD: Medical University of South Carolina\nEndodontics: Medical College of Virginia\nPrivate Practice, Portland, ME\nOrientation\nOrientation to the program begins the first week. The resident is introduced to dental clinic policies and protocols, clinical privileges, computerized patient record system (CPRS) and other operational details of a hospital based dental practice. A Resident's Manual is provided to serve as a reference source for clinic and hospital policies and procedures and for information on dental materials and equipment.\nGoals and Objectives\nThe intent of the clinical program is to enable the resident to meet the following goals and objectives:\nDidactic Program\nThe intent of the didactic program is to complement clinical experience with the following:\nRotations and Special Clinics\nOverall Goals and objectives\nPast Residents' Experiences\nThe following represents an approximation of the chair-side procedures an average resident accomplishes in one year.\nPROCEDURE Numbers\nComprehensive oral evaluations 50 - 75\nEndodontic canals filled 20 - 30\nComplete denture units 15 - 20\nRemovable partial denture units 15 - 30\nSurgical placement of dental implants 0 - 20\nImplant supported crowns seated 5 - 15\nSimple/Surgical Extractions 200 - 300\nBiopsies 5\nAnterior Composite Surfaces 250 - 350\nPosterior Composite Surfaces 150 - 250\nAlloy Restoration Surfaces 125 - 200\nFixed units (PFM, FGC, Ceramic) 25 - 50\nPeriodontal surgical procedures 5 - 10\n             \nApplications\nResidents must meet the following requirements:\nAll qualified candidates will receive equal consideration regardless of race, color, national origin, sex, age or sexual orientation.\nTo apply to this program:\n         Tel: 207-623-8411 ext. 5304\n         Fax: 207-626-4741\n         E-mail:  nicholas.sirois@va.gov\nDeadline:  Applications should be completed no later than October 15th.\nInterviews\nWhen all application materials have been received, interviews and tours of the clinic and facility will be arranged by invitation from the Program Director,. These interviews are normally scheduled from November through early December.\nMaine Resources:Official Website of the State of Maine *City of Augusta, Maine **City of Portland, Maine **\n  *Links will take you outside of the Department of Veterans Affairs Website.\n**Links will take you outside of the Department of Veterans Affairs Website.  VA does not endorse and is not responsible for the content of the linked web site.\n \nYou will need the Adobe Acrobat Reader to access PDF documents on this web site. The Adobe Acrobat reader can be downloaded here.\nLast updated: November 15, 2021", "Program Name": "Department of Veterans Affairs Medical Center at Togus, Maine", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://www.va.gov/maine-health-care/work-with-us/internships-and-fellowships/advanced-education-in-general-dentistry/", "keywords": ["dental implants", "overall goals", "dental clinic", "first week", "patient reception", "other week", "first veteran", "advanced education", "clinical staff", "operational details"]},
{"objectID": "08fbd8274b73e46fb82967e21420b180", "title": "General Dentistry Residency - Certificate | University of the Pacific", "body": "The Advanced Education in General Dentistry (AEGD) program is a one-year, accredited postgraduate residency in general dentistry providing advanced training and clinical experience. The core of our program involves treating patients requiring comprehensive dental care.\nThe AEGD residency program is located in our stand-alone clinic in Union City, about 45 minutes across the bay from San Francisco.\nThe AEGD program provides residents the opportunity to provide comprehensive dental care to healthy and medically compromised patients, attend supplemental seminars and participate in rotations at community clinics and in a hospital setting.\nAn optional second year allows residents to gain more in-depth training, offering the flexibility to pursue individual interests, advanced clinical cases, teaching or research projects.\nIf you are interested in applying to the program, please review the Application Process section on this site. This site will be updated as dates become available.\n \nUniversity of the Pacific, Arthur A. Dugoni School of Dentistry's Advanced Education in General Dentistry Residency Program site is located in Union City. The Union City clinic is a stand-alone facility located approximately 35 miles southeast of San Francisco. \nThe AEGD program will be participating and taking applications for the resident class of 2020 - 2021. The program consists of a one-year, accredited postgraduate residency in general dentistry with an optional second year. The core of the program involves providing advanced clinical treatment to patients requiring comprehensive general dental care with an emphasis on Caries Management by Risk Assessment (CAMBRA). The residents provide comprehensive dental care along with supplemented seminars and rotations. \nThere is an opportunity to gain more in-depth training in an optional accredited second-year residency training program. The second year allows greater flexibility to pursue individual interests, advanced clinical cases, teaching, or research projects.\nThe start date for the program each year is July 1. Residents have time off during the school's winter break and school holidays, as well as an additional 10 days of leave that can be scheduled with the approval of the site director.\nThere are no tuition requirements to participate in either site. AEGD residents receive an educational stipend during the year which is paid bi-monthly over a 12-month period.\nResidents will be given the option of participating in the dental school's medical coverage program, but will be required to participate in the disability coverage program. Malpractice insurance coverage is provided by the School of Dentistry.\nFor a detailed list of expected areas of resident competency after completion of the program, please see our Competency Statements.\nThe AEGD residency site is located at the University of the Pacific's Union City Dental Care Clinic. The clinic has a private practice setting and 13-chair facility which is located 35 miles southeast of San Francisco. In addition to being close to San Francisco, Union City offers easy freeway access to a variety of attractions in California. The clinic has served the community for close to 30 years.\nThere is specialty supervision available in endodontics, esthetics, implants, orthodontics, oral and maxillofacial surgery, periodontics, and fixed and removable prosthodontics. There is also supervised dental care for special patients with developmental disabilities or severe medical problems and geriatric individuals.\nIn addition to the specialties listed above, there is emphasis placed on patient management with specific instruction in working with fearful dental patients; using nitrous oxide and other sedatives; providing dental care in the hospital operating room with general anesthesia; and managing patients with oral lesions and facial pain. \nResidents work with dental staff members in the management of their practices and the delivery of dental services. Instruction is provided in four-handed dentistry techniques and practice management concepts.\nRotations at the Union City site are based on local needs. Our current rotations are in the areas of advanced implant restorations, emergency dentistry, hospital dentistry/special needs care, pediatric dentistry/perinatal care, geriatric dentistry and predoctoral teaching.\nThere is a series of seminars on each aspect of dentistry taught in the program in the areas of Caries Management by Risk Assessment (CAMBRA), endodontics, aesthetics, fixed and removable prosthodontics, hospital dentistry, special care dentistry, oral and maxillofacial surgery, oral pathology-facial pain, orthodontics, pediatrics, periodontics, geriatric and treatment planning. Seminar topics also include quality assurance, practice management, literature review, dental emergencies and medical risk assessment.\nResidents participate in some seminars via videoconferencing technology.\nAfter office hours and on weekends, one resident is assigned to see patients who have dental emergencies. At times when the resident is not in the dental clinics, the resident can answer calls at home or use a communicating device which will be supplied to the resident. The resident may also spend time in the hospital emergency room. During that time, the resident will have an opportunity not only to treat dental emergencies but also to observe the management of patients with medical emergencies.\nThe Admissions Office in San Francisco is currently managing the application process for our AEGD site located in Union City. Pacific uses the ADEA PASS application service and the National Matching Services Inc (NMSI) Program notification system. See below for detailed instructions. If you have any questions that are not answered by the information below, contact us. \nApplicants must be graduates of an accredited dental school at the start of the residency year. Applicants are required to have passed the National Board Examination Part I and II. A dental license is not required.\nThe University of the Pacific Arthur A. Dugoni School of Dentistry AEGD Program accepts application materials through the American Dental Education Association, Postgraduate Application Support Service (PASS). This service enables applicants to send an original copy of most application materials to PASS for distribution to all the programs that the applicant selects. PASS must receive application materials by November 14, 2022.  Dates will be update when information is confirmed). Information and application materials for PASS can be obtained from:\nADEA PASS\r\n1625 Massachusetts Avenue NW, Suite 600\r\nWashington, DC 20036-2212\r\n800.353.2237 or 202.667.1887\r\nFax: 202.667.4983\nThe University of the Pacific Arthur A. Dugoni School of Dentistry AEGD Program uses the postdoctoral National Matching Services Inc. (NMSI) Program for notification of program acceptance.  Applicants must submit an applicant agreement to NMSI and obtain a registration number.  Match applicant registration opens on May 14, 2022.\nEach applicant and each program must submit a rank order list to National Matching Services Inc. The rank order list will be compiled and applicants and the program will be matched. The Match applicant agreement and information can be obtained from:\nNational Matching Service, Inc.\r\n20 Holly Street, Suite 301\r\nToronto, Ontario\r\nCanada M4S 3B1\r\n416.977.3431\r\nFax: 416.977.5020\nFor further information about the admission process, contact the Admissions Administrator — AEGD Program at 415.929.6677 or gsue@pacific.edu.\nA deferment is a period during which borrowers are entitled to postpone repayment of the principal balance of their loans.\nResidents in the AEGD program are not eligible to receive financial aid. Dental residents may be entitled to in-school deferments on existing student loans. If you are entitled to receive one, you should be proactive in ensuring that you receive your deferment.\nLenders must grant an in-school deferment based on enrollment and in-school status of a borrower as certified by an institution of higher education or an affiliated hospital. It is anticipated that lenders will be able to determine the borrower's eligibility for the deferment based on:\nAgain, dental residents must double-check to see if this has occurred. If the lender defers the loan based on a loan application or enrollment status information, the lender must notify the borrower that the deferment was granted and give the borrower the option of continuing to repay the loan.\nLoan consolidation can simplify repayment and may lower your monthly payment. You can combine your student loans even if you borrowed from more than one lender, have more than one type of loan or have different interest rates or repayment plans on the loans.\nYou must be in your grace period, deferment or in repayment to consolidate your loans. The following loans may be consolidated:\nYou can choose which loans to consolidate. Under certain circumstances, consolidation loans can be consolidated with other student loans. Check with the Direct Loan Program for details about loan consolidation.\nThe fixed interest rate is based on the weighted average interest rate of all the loans your consolidate, rounded up to the next highest 1/8%, with a maximum rate of 8.25%. Your student loan interest may be tax deductible if you meet certain conditions. Contact your tax advisor or the IRS for details.\nYou have a choice of a standard, graduated, income-sensitive or extended repayment plan, and you may change the repayment plan once a year. Depending on the total amount of your student loans, the repayment will take 10 to 30 years.\nContact the Direct Loan Program to apply for loan consolidation. If you are in repayment, the program can temporarily suspend your loan payments while your consolidation is being processed.\nThe following statements describe the graduates of Pacific's AEGD program. They are intended to communicate the expectations of the faculty to the resident and serve as the basis for evaluation of resident's satisfactory completion of the program.\nIn order to facilitate reading this list of statements, certain terms have been predefined to avoid repetitive definition. In general, the definitions proposed by Chambers and Gerrow have been followed, albeit with some additions and modifications.\nIn situations where it is expected that the program graduate will be able to, and likely to, actually perform the necessary procedures, the terms \"perform\", \"provide\", \"restore\", or \"treat\" have been used.\nIn circumstances where the graduate may perform some treatment but is more likely to oversee treatment or refer, the term \"manage\" is used.\nTo avoid repetition, the term \"appropriate\" is not used in these statements. It is assumed that all knowledge, skills, and procedures described will be performed for appropriate reasons, in appropriate circumstances, and in an appropriate manner.\nEach statement is designated as an area of competency (C) in which graduates are expected to have little experience at the beginning of their programs, but competent at a student level.  At the end of the program, the resident will gain further experience, skill, and judgment as the program progresses at a resident competency level.\nThe following are competency statements that describe the additional areas, beyond those of the first year program, that apply to residents completing the second year program. 1. Integrate all aspects of dentistry in the treatment of patients with complex dental, medical and social situations. (C)\nAdapted from Chambers and Gerrow1 \nAssess. Evaluation of physical, written, and psychological data in a systematic and comprehensive fashion to detect entities or patterns that would initiate or modify treatment, referral, or additional assessment. Assessment entails understanding of relevant theory, and may also entail skill in using specialized equipment or techniques. But assessment is always controlled by an understanding of the purpose for which it is made and its appropriateness under the present circumstances. Recognition is a more limited term that does not subsume the notion of evaluating findings. Diagnosis is a more inclusive term which relates evaluated findings to treatment alternatives.\nCompetency. Behavior expected of the beginning practitioner. This behavior incorporates understanding, skill, and values in an integrated response to the full range of requirements presenting in practice. The level of performance requires some degree of speed and accuracy consistent with patient well-being but not performance at the highest level possible. It also requires an awareness of what constitutes acceptable performance under the circumstances and desire for self improvement.\nDiagnose. Diagnosing means systematically comparing a comprehensive database on the patient with an understanding of dental and related medical theory to identify recognized disease entities or treatable conditions. The concept of diagnosis subsumes an understanding of disease etiology and natural history.\nDiscuss (communicate, consult, explain, present).  A two-way exchange that serves both the practitioner's needs and those of patients, staff, colleagues, and others with whom the practitioner communicates. The conversation, writing, or other means of exchange must be free of emotional or other distorting factors and the practitioner must be capable of expressing and listening in terms the other party understands. [Caution should be exercised with using these verbs to ensure that the communication is between the practitioner and the patient. Communication between the student and faculty is language reminiscent of the old instructional objectives and is not evidence of competency.]\nDocument. Making, organizing, and preserving information in standardized, usable, and legally required format.\nManage. Management refers to the selection of treatment-including: no intervention; choice of specific care providers-including hygienists, and medical and dental specialists; timing and evaluation of treatment success; proper handling of sequela; and insurance of patient comprehension of and appropriate participation in the process. In circumstances where the graduate may perform some treatment but is more likely to oversee treatment or refer, the term \"manage\" is used. In situations where it is expected that practitioners will be capable of and likely to provide treatment as well as oversee it, the terms \"treat\", \"provide\", or \"perform\", will be used.\nMonitor. Systematic vigilance to potentially important conditions with an intention to intervene should critical changes occur. Normally monitoring is part of the process of management.\nObtain (collect, acquire). Making data available through inspection, questioning (patients, physicians, relatives), review of records etc., or capturing data by using diagnostic procedures. Health histories, radiographs, casts, and consults are obtained. It is always assumed that the procedures for obtaining data are performed accurately so that no bias is introduced, are appropriate to the circumstances, and no more invasive than necessary, and are legal.\nPatients With Special Needs. Those patients whose medical, physical, psychological, or social situations make it necessary to modify normal dental routines in order to provide dental treatment for that individual. These individuals include, but are not limited to, people with developmental disabilities, complex medical problems, and significant physical limitations.\nPerform (conduct, restore, treat). When a procedure is performed, it is assumed that it will be done with reasonable speed and without negative unforeseen consequences. Quality will be such that the function for which the procedure was undertaken is satisfied consistent with the prevailing standard of care and that the practitioner accurately evaluates the results and takes needed corrective action. All preparatory and collateral procedures are assumed to be a part of the performance.\nPractice. Used to describe a general habit of practice, such as \"practice consistent with applicable laws and regulations.\"\nPrepare (see perform).\nPresent (see discuss).\nPrevent [the effects of]. The negative effects of known or anticipated risks can be prevented through reasonable precautions. This includes understanding and being able to discuss the risk and necessary precautions and skill in carrying out the precaution. Because preventing future damage is of necessity a response to an internalized stimulus rather than a present one, additional emphasis is placed on supportive values.\nProvide care (see perform).\nRecognize (differentiate, identify). Identify the presence of an entity or pattern that appears to have significance for patient management. Recognition is not as broad as assessment -- assessment requires systematic collection and evaluation of data. Recognition does not involve the degree of judgment entailed by diagnosis. [Caution is necessary with these terms. They are often use in the old instructional objectives literature to refer to behavior students perform for instructors. They can only be used for competencies when practitioners recognize, differentiate, or identify for patients or staff.]\nRefer. A referral includes determination that assessment, diagnosis, or treatment is required which is beyond the practitioner's competency. It also includes discussion of the necessity for the referral and of alternatives with the patient, discussion and cooperation with the professionals to whom the patient is referred, and follow-up evaluation.\nRestore (see perform).\nSkill. The residual performance patterns of foundation skills that is incorporated into competency. The importance of the skill is more than speed and accuracy: it is the coordination of performance patterns into an organized competency whole.\nTreat (see perform).\nUse. This term refers to a collateral performance. In the course of providing care, precautions and specialized routines may be required. For example, infection control and rapport building communication are used. Understanding the collateral procedure and its relation to overall care is assumed. It is often the case that supporting values are especially important for procedures that are needed -- they are usually mentioned specifically because their value requires reinforcement. [\"Utilize\" is a stylistic affectation that should be avoided.]\nUnderstanding. The residual cognitive foundation knowledge that is incorporated into competency. Understanding is more than broad knowledge of details: it is organized knowledge that is useful in performing the competency. [Caution should be used with this term. Understanding alone is not a competency; it must be blended with skill and values.] Values. Preferences for professional appropriate behavior in the absence of compelling or constraining forces. Values can only be inferred from practitioner's behavior when alternatives are available. \"Talking about\" values reflects a foundation knowledge; valuing can be inferred by observing the practitioner's attempts to persuade others. [Caution should be used with this term. Valuing alone is not a competency; it must be blended with skill and understanding.]\n155 Fifth Street\r\nSan Francisco, CA 94103", "Program Name": "University of the Pacific, Union City", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dental.pacific.edu/dental/academic-programs/advanced-education-in-general-dentistry", "keywords": ["other sedatives", "nitrous oxide", "resident competency", "principal balance", "advanced education", "specialized routines", "current rotations", "organized competency", "repetitive definition", "general anesthesia"]},
{"objectID": "d86bf704d432514d8e0830ca897ce31c", "title": "", "body": "To receive more information about Nova Southeastern University or to apply now, use one of the options below.\nRequest Information\n-- Select Program --\nDoctoral Program\nInternational Program\nPostdoctoral Programs\n\nAdmissions Process\n-- Select Program --\nDoctoral Program\nInternational Program\n\nAEGD\nMS in Dentistry\nEndodontics\nOperative Dentistry\nOral Surgery\nOrthodontics\nPediatric Dentistry\nPeriodontics\nProsthodontics\n\n\nOur Brochure\n\nView our brochure of programs, curriculum, tuition and fees, overview of our college, and more.\nThe twelve-month Advanced Education in General Dentistry residency provides opportunities for advanced training with special emphasis in clinical general dentistry. The program is recognized by the Commission on Dental Accreditation of the American Dental Association, and culminates in a certificate from Nova Southeastern University College of Dental Medicine.\nThe Advanced Education in General Dentistry (AEGD) residency is designed to refine and enhance the resident's clinical skills and scientific knowledge base in order to improve the practice of general dentistry. The AEGD program offered by NSU College of Dental Medicine is a one year program with optional second year that is fully accredited by the Commission on Dental Accreditation.\nThere is an optional second year (AEGD 2) with an emphasis in general dentistry.\nThe AEGD residency has a well defined clinical and didactic component. This course of study is designed to provide advanced training in clinical dentistry beyond the level of predoctoral education. The comprehensive program of didactic lectures and seminars in all disciplines of dentistry support the training at both the clinic and rotation settings.\nAt the commencement of the program there is an intensive orientation program during which, residents will be given training in areas of dentistry that will help enhance their learning experience for the next twelve months. All residents will obtain certification/training in Advanced Endodontics (rotary endodontic therapy), and implant placement &amp; restoration. The intention of providing these special seminars to the curriculum are to help the residents maximize their learning experience while in the program and to provide a solid foundation for expansion of knowledge in these areas throughout their career.\nThe clinical aspect of the residency occurs Tuesday through Friday, and includes general patient care as well as rotations.  With this schedule, approximately eighty percent of the resident's time is directed towards clinical education.\nGainful Employment Disclosure\nGainful Employment Disclosure\nGainful Employment Disclosure\n©  2022 Nova Southeastern University  | 3301 College Avenue, Fort Lauderdale, Florida 33314-7796 | 800-541-6682 Contact Us | Using Our Site | Privacy Policy | GDPR Privacy Notice |  ADA Policy", "Program Name": "Nova Southeastern University", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dental.nova.edu/aegd/index.html", "keywords": ["clinical aspect", "scientific knowledge", "general patient", "clinical education", "comprehensive program", "clinical skills", "advanced education", "solid foundation", "endodontic therapy", "general dentistry"]},
{"objectID": "9c8a2c603343f0b89425f5ef62891445", "title": "Advanced Education in General Dentistry | Dental Medicine | MUSC", "body": "", "Program Name": "Medical University of South Carolina", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dentistry.musc.edu/programs/prospective/programs/general", "keywords": []},
{"objectID": "3cc3c5658bef2058f2d982ae5237c1f2", "title": "UCSF/NYU Langone Health Advanced Education in General Dentistry Overview | School of Dentistry", "body": "", "Program Name": "NYU Langone Dental Medicine - San Francisco, CA-UCSF Campus", "Program Type": "Advanced Education in General Dentistry (12 months)", "url": "https://dentistry.ucsf.edu/programs/post-grad/aegd", "keywords": []},
{"title": "NYU Langone Dental Medicine - Princess Anne, MD / Advanced Education in General Dentistry (12 months)", "active": false}
]